{"_id":"9780241393338","category":"Crime","decription":"With a loving girlfriend, close family, good mates and a promising career, Toby has always been lucky, until a brutal attack forces him to take refuge in The Ivy House, his ancestral home, where everything changes… In this tale of memory, secrets, families and fortune, we see how thoughtless decisions can alter one’s path in ways difficult to foresee and impossible to undo, with consequences rolling darkly down through the family tree. Compelling and darkly beautiful, this is incendiary literary crime.\n\n- Recommended by Karina Clifford, Dubray Stillorgan\n\nFor me it all goes back to that night, the dark corroded hinge between before and after, the slipped-in sheet of trick glass that tints everything on one side in its own murky colours and leaves everything on the other luminous and untouchable. One night changes everything for Toby. He's always led a charmed life - until a brutal attack leaves him damaged and traumatised, unsure even of the person he used to be. He seeks refuge at his family's ancestral home, the Ivy House, filled with memories of wild-strawberry summers and teenage parties with his cousins.But not long after Toby's arrival, a discovery is made: a skull, tucked neatly inside the old wych elm in the garden.As detectives begin to close in, Toby is forced to examine everything he thought he knew about his family, his past, and himself.A spellbinding standalone from a literary writer who turns the crime genre inside out, The Wych Elm asks what we become, and what we're capable of, if we no longer know who we are.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0264049_9780241393338_300.jpeg","name":"The Wych Elm","author":"Tana French","BookUrl":"https://www.dubraybooks.ie/The-Wych-Elm_9780241393338","PublishDate":"21/02/2019"}
{"_id":"9780751569346","category":"Crime","decription":"Following on from The Ruin, Garda Cormac Reilly returns for another tough murder case in Galway City. This time, a prodigy-come-heiress is suspected of being killed in a hit and run, and Cormac’s own girlfriend is implicated. As he risks his career to protect those he loves, what follows is a twisting mystery that leaves the reader demanding to get to the heart of it. This is compelling writing from one of the freshest voices in Irish crime fiction. \n\n- Recommended by Emmet Driver, Dubray Blackrock\n\n'Dervla McTiernan is a future star of the genre' Chris Brookmyre ******When Detective Cormac Reilly's girlfriend Emma stumbles across the victim of a hit and run early one morning, he is first on the scene of a murder that would otherwise never have been assigned to him. The dead girl is carrying an ID, that of Carline Darcy, heir apparent to Darcy Therapeutics, Ireland's most successful pharmaceutical company. Darcy Therapeutics has a finger in every pie, from sponsoring university research facilities to funding political parties to philanthropy - it has funded Emma's own ground-breaking research. The investigation into Carline's death promises to be high profile and high pressure.   As Cormac investigates, evidence mounts that the death is linked to a Darcy laboratory and, increasingly, to Emma herself. Cormac is sure she couldn't be involved, but how well does he really know her? After all, this isn't the first time Emma's been accused of murder...","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0261475_9780751569346_300.jpeg","name":"The Scholar","author":"Dervla McTiernan","BookUrl":"https://www.dubraybooks.ie/The-Scholar_9780751569346","PublishDate":"07/03/2019"}
{"_id":"9780751569315","category":"Crime","decription":"The supposed suicide of a young man makes DI Cormac Reilly’s first case back in Galway a deeply personal one. As his quest for answers is repeatedly blocked by his own colleagues, he must join forces with the victim’s distraught family in a search for justice that brings the reader into the fold and makes their hunt your own. Powerful writing from a new voice in Irish crime, set in a fresh location with characters that live beyond the page.\n\n- Recommended by Emmet Driver, Dubray Blackrock\n\n'Excellently written and at times, heartcatchingly sad' MARIAN KEYES*****CORMAC REILLY IS ABOUT TO REOPEN A CASE IT TOOK HIM TWENTY YEARS TO FORGET . . . On his first week on the job, Garda Cormac Reilly responds to a call at a decrepit country house to find two silent, neglected children waiting for him - fifteen-year-old Maude and five-year-old Jack. Their mother lies dead upstairs. Twenty years later, Cormac has left his high-flying career as a detective in Dublin and returned to Galway. As he struggles to navigate the politics of a new police station, Maude and Jack return to haunt him.What ties a recent suicide to the woman's death so long ago? And who among his new colleagues can Cormac really trust?*****This unsettling crime debut draws us deep into the dark heart of Ireland and asks who will protect you when the authorities can't - or won't. Perfect for fans of Tana French, Jane Casey, Liz Nugent, Susie Steiner and Caz Frear.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0252964_9780751569315_300.jpeg","name":"The Ruin","author":"Dervla McTiernan","BookUrl":"https://www.dubraybooks.ie/The-Ruin_9780751569315","PublishDate":"06/09/2018"}
{"_id":"9781785152184","category":"Crime","decription":"In the 28th novel in Donna Leon's bestselling Commissario Brunetti series, Brunetti's father-in-law, the Count Falier, urges Brunetti to investigate and intervene in the seemingly innocent plan of the Count's best friend, the elderly Gonzalo Rodriguez de Tejeda, to adopt a much younger man as his son. Under Italian inheritance laws this man would become heir to Gonzalo's entire fortune, a prospect Gonzalo's friends find appalling. For his part, Brunetti wonders why the old man can't be allowed his pleasure in peace. Not long after Gonzalo unexpectedly passes away, one of Gonzalo's oldest friends, just arrived in Venice for the memorial service, is strangled in her hotel room. Now with an urgent case to solve, Brunetti is drawn reluctantly into the long-hidden mystery in Gonzalo's life that ultimately led to murder.Once again, Donna Leon brilliantly follows the twists and turns of the human condition, reuniting us with some of crime fiction's most memorable and enduring characters.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0267636_9781785152184_300.jpeg","name":"Unto Us a Son Is Given","author":"Donna Leon","BookUrl":"https://www.dubraybooks.ie/UNTO-US-A-SON-IS-GIVEN_9781785152184","PublishDate":"05/03/2019"}
{"_id":"9780008234188","category":"Crime","decription":"THE NUMBER ONE NEW YORK TIMES BESTSELLER           `Astounding. Thrilling. Amazing' Gillian Flynn          `One of those rare books that really is unputdownable' Stephen King          'Twisted to the power of max' Val McDermid          `A dark, twisty confection' Ruth Ware             What did she see?           It's been ten long months since Anna Fox last left her home. Ten months during which she has haunted the rooms of her old New York house, lost in her memories, too terrified to step outside.          Anna's lifeline to the real world is her window, where she sits, watching her neighbours. When the Russells move in, Anna is instantly drawn to them. A picture-perfect family, they are an echo of the life that was once hers.          But one evening, a frenzied scream rips across the silence, and Anna witnesses something no one was supposed to see. Now she must uncover the truth about what really happened. But even if she does, will anyone believe her? And can she even trust herself?","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258794_9780008234188_300.jpeg","name":"The Woman in the Window","author":"A. J. Finn","BookUrl":"https://www.dubraybooks.ie/The-Woman-in-the-Window_9780008234188","PublishDate":"17/12/2018"}
{"_id":"9780349142111","category":"Crime","decription":"'One of the most stunning debuts I've ever read...Read it!' David Baldacci  'Packed with sneaky moves and teasing possibilities that keep the reader guessing...The Dry is a breathless page-turner' Janet Maslin, New York Times  WHO REALLY KILLED THE HADLER FAMILY?  I just can't understand how someone like him could do something like that.  Amid the worst drought to ravage Australia in a century, it hasn't rained in small country town Kiewarra for two years. Tensions in the community become unbearable when three members of the Hadler family are brutally murdered. Everyone thinks Luke Hadler, who committed suicide after slaughtering his wife and six-year-old son, is guilty.  Policeman Aaron Falk returns to the town of his youth for the funeral of his childhood best friend, and is unwillingly drawn into the investigation. As questions mount and suspicion spreads through the town, Falk is forced to confront the community that rejected him twenty years earlier. Because Falk and Luke Hadler shared a secret, one which Luke's death threatens to unearth.And as Falk probes deeper into the killings, secrets from his past and why he left home bubble to the surface as he questions the truth of his friend's crime.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/022/0229946_9780349142111_300.jpeg","name":"The Dry","author":"Jane Harper","BookUrl":"https://www.dubraybooks.ie/The-Dry_9780349142111","PublishDate":"01/06/2017"}
{"_id":"9781787474314","category":"Crime","decription":"Death stalked the Vale.In every corner, every whisper.They just didn't know it yet.Six neighbours, six secrets, six reasons to want Olive Collins dead.In the exclusive gated community of Withered Vale, people's lives appear as perfect as their beautifully manicured lawns. Money, success, privilege - the residents have it all. Life is good. There's just one problem. Olive Collins' dead body has been rotting inside number four for the last three months. Her neighbours say they're shocked at the discovery but nobody thought to check on her when she vanished from sight. The police start to ask questions and the seemingly flawless facade begins to crack. Because, when it comes to Olive's neighbours, it seems each of them has something to hide, something to lose and everything to gain from her death. The new psychological thriller from the bestselling author of The Confession, perfect for fans of The Couple Next Door.See what everyone is saying about Jo Spain, the hottest new name in psychological thrillers:'Enthralling' JP Delaney'Chilling' Sunday Times'Arresting' Sunday Express'Brilliant' BA Paris'Gripping' Best'Compulsive' Sunday Mirror'Addictive'Michelle Frances'Refreshing'Express","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259982_dirty-little-secrets_300.jpeg","name":"Dirty Little Secrets","author":"Jo Spain","BookUrl":"https://www.dubraybooks.ie/Dirty-Little-Secrets_9781787474314","PublishDate":"24/01/2019"}
{"_id":"9780008227548","category":"Crime","decription":"The explosive, highly anticipated conclusion to the epic Cartel trilogy from the New York Times bestselling author of The Force.             The war has come home.           For over forty years, Art Keller has been on the front lines of America's longest conflict: The War On Drugs. His obsession with defeating the godfather of the Sinaloa Cartel - Adan Barrera - has cost him people he loves, even taken a piece of his soul. Now Keller is elevated to the highest ranks of the DEA, only to find that in destroying one monster he has created thirty more that are wreaking chaos in his beloved Mexico. But not just there. Fighting to end the heroin epidemic scourging America, Keller finds himself surrounded by an incoming administration that's in bed with the very drug traffickers that Keller is trying to bring down. From the slums of Guatemala to the marbled corridors of Washington, D.C., Winslow follows a new generation of narcos, cops, addicts, politicians, and mere children fleeing the violence for the chance of a life in a new country. A shattering tale of vengeance, corruption and justice, The Border is an unflinching portrait of modern America, a story of - and for - our time.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0264193_9780008227548_300.jpeg","name":"Border","author":"Don Winslow","BookUrl":"https://www.dubraybooks.ie/Border_9780008227548","PublishDate":"26/02/2019"}
{"_id":"9780571347155","category":"Poetry","decription":"Seamus Heaney had the idea to form a personal selection of poems from across the entire arc of his writing life, small yet comprehensive enough to serve as an introduction for all comers. He never managed to do this himself, and no other edition exists which has such a broad range, drawing from first to last of his prize-winning collections. But now, finally, the project has been returned to, resulting in an intimate gathering of poems chosen and introduced by the Heaney family. In 100 Poems, readers will enjoy the most loved and celebrated poems, as well as discovering new favourites. It is a singular and welcoming anthology, reaching out far and wide, now and for years to come.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0250859_9780571347155_300.jpeg","name":"100 Poems","author":"Seamus Heaney","BookUrl":"https://www.dubraybooks.ie/100-Poems_9780571347155","PublishDate":"28/06/2018"}
{"_id":"9780853424062","category":"Poetry","decription":"Riots greeted the first performance of The Playboy of the Western World at Dublin's Abbey Theatre on 26 January 1907. Eggs, potatoes and even a slice of fruit cake were hurled at the actors during subsequent performances, and it seems unlikely that much of the actual play could have been heard in the uproar. Synge's The Playboy of the Western World, with the two other plays in this volume, Yeats's The Countess Cathleen (1892) and O'Casey's Cock-a-doodle Dandy (1949), mark vital stages in the rich explosion of Irish drama that first made itself heard at the turn of the century and gathered momentum during the Easter Rising of 1916 and the Civil War.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/023/0236627_9780853424062_300.jpeg","name":"The Playboy of the Western World","author":"J. M. Synge","BookUrl":"https://www.dubraybooks.ie/The-Playboy-of-the-Western-World_9780853424062","PublishDate":"01/01/1986"}
{"_id":"9781408106020","category":"Poetry","decription":"The slamming of the front door at the end of A Doll's House shatters the romantic masquerade of the Helmers' marriage. In their stultifying and infantilised relationship, Nora and Torvald have deceived themselves and each other both consciously and subconsciously, until Nora acknowledges the need for individual freedom. A revised student edition of classic set text: A Doll's House (1879), is a masterpiece of theatrical craft which, for the first time portrayed the tragic hypocrisy of Victorian middle class marriage on stage. The play ushered in a new social era and \"exploded like a bomb into contemporary life\". \"Meyer's translations of Ibsen are a major fact in one's general sense of post-war drama. Their vital pace, their unforced insistence on the poetic centre of Ibsen's genius, have beaten academic versions from the field\" (George Steiner)","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/011/0117595_9781408106020_300.jpeg","name":"A Doll's House","author":"Henrik Ibsen","BookUrl":"https://www.dubraybooks.ie/A-Dolls-House_9781408106020","PublishDate":"19/08/2008"}
{"_id":"9781786893130","category":"Poetry","decription":"THESE POEMS AND NOTEBOOKS ARE THE LAST WORD FROM THE LATE, GREAT LEONARD COHENThe Flame is a stunning collection of Leonard Cohen's last poems and writings, selected and ordered by Cohen in the final months of his life. The book contains an extensive selection from Cohen's notebooks, featuring lyrics, prose pieces and illustrations, which he kept in poetic form throughout his life, and offers an unprecedentedly intimate look inside the life and mind of a singular artist and thinker.An enormously powerful final chapter in Cohen's storied literary career, The Flame showcases the full range of Leonard Cohen's lyricism, from the exquisitely transcendent to the darkly funny. By turns devastatingly sad and winningly strange, these are the works of a poet and lyricist who has plumbed the depths of our darkest questions and come up wanting, yearning for more.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256697_9781786893130_300.jpeg","name":"The Flame","author":"Leonard Cohen","BookUrl":"https://www.dubraybooks.ie/The-Flame_9781786893130","PublishDate":"02/10/2018"}
{"_id":"9780717166978","category":"Poetry","decription":"In the words of Seamus Heaney, great poetry can 'Catch the heart off guard and blow it open'. This beautifully illustrated collection contains the greatest poems from the greatest Irish poets, including Jonathan Swift, Thomas Moore, Oscar Wilde, WB Yeats, James Joyce, Patrick Kavanagh and Seamus Heaney. Discover classic works such as My Dark Rosaleen and The Ballad of Reading Gaol alongside more modern pieces such as Postscript, He Wishes for the Cloths of Heaven, Epic and The Planter's Daughter. Dive in and let your heart 'Dance like a wave of the sea'.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/014/0146270_9780717166978_300.jpeg","name":"Pocket Irish Poetry","author":"Tony Potter","BookUrl":"https://www.dubraybooks.ie/Pocket-Irish-Poetry_9780717166978","PublishDate":"06/02/2015"}
{"_id":"9780717158225","category":"Poetry","decription":"This delightful collection of poems, illustrated by celebrated Irish artist, Harry Clarke, is based on a book published nearly 100 years ago. Now this new book will delight Harry Clarke fans everywhere bringing together, once more, many of the original poems and illustrations, together with some new additions.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0098021_9780717158225_300.jpeg","name":"The Year's at the Spring: An Anthology of Best-Loved Poems","author":"Harry Clarke","BookUrl":"https://www.dubraybooks.ie/The-Years-at-the-Spring-An-Anthology-of-Best-Loved-Poems_9780717158225","PublishDate":"04/10/2013"}
{"_id":"9781449474256","category":"Poetry","decription":"The book is divided into four chapters, and each chapter serves a different purpose; deals with a different pain; heals a different heartache. milk and honey takes readers through a journey of the most bitter moments in life and finds sweetness in them because there is sweetness everywhere ifyou are just willing to look.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/021/0213261_9781449474256_300.jpeg","name":"Milk and Honey","author":"Rupi Kaur","BookUrl":"https://www.dubraybooks.ie/Milk-and-Honey_9781449474256","PublishDate":"05/11/2015"}
{"_id":"9781846149542","category":"Poetry","decription":"As heard on BBC Radio 4, the essential prescriptions from William Sieghart's poetic dispensary  When we're grieving, when we're broken-hearted, and when we find  ourselves struggling to understand the things we're feeling, we long for  the connection poetry can provide. To find the right poem at that  crucial moment, one capable of expressing our situation with  considerably more elegance than we could muster ourselves, is to  discover a powerful sense of complicity, and that precious realization: I'm not the only one who feels like this.  In  the years since he first had the idea of prescribing short, powerful  poems for all manner of spiritual ailments, William Sieghart has taken  his Poetry Pharmacy around the length and breadth of Britain, into the  pages of the Guardian, onto BBC Radio 4 and onto the television,  honing his prescriptions all the time. This pocket-sized book presents  the most essential poems in his dispensary: those which, again and  again, have really shown themselves to work. Whether you are  suffering from loneliness, lack of courage, heartbreak, hopelessness, or  even from an excess of ego, there is something here to ease your pain.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/023/0233452_9781846149542_300.jpeg","name":"Poetry Pharmacy","author":"William Sieghart","BookUrl":"https://www.dubraybooks.ie/Poetry-Pharmacy_9781846149542","PublishDate":"28/09/2017"}
{"_id":"9781471177910","category":"Poetry","decription":"A revised hardcover edition of the #1 New York Times bestseller the sun and her flowers by Rupi Kaur, author the #1 New York Times bestseller milk and honey. Her long-awaited second collection of poetry is a vibrant and transcendent journey about growth and healing. Ancestry and honouring one's roots. Expatriation and rising up to find a home within yourself.  Divided into five chapters and illustrated by Kaur, the sun and her flowers is a journey of wilting, falling, rooting, rising, and blooming. A celebration of love in all its forms. this is the recipe of life said my mother as she held me in her arms as i wept think of those flowers you plant in the garden each year  they will teach you that people too must wilt fall root rise in order to bloom","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257274_9781471177910_300.jpeg","name":"Sun & Her Flowers","author":"Rupi Kaur","BookUrl":"https://www.dubraybooks.ie/Sun-Her-Flowers_9781471177910","PublishDate":"23/10/2018"}
{"_id":"9781472153739","category":"Poetry","decription":"'And just like that, like a simpleneighbourhood event, a miracle istaking place.'If I have any secret stash of poems, anywhere, it might be about love, not anger,' Mary Oliver once said in an interview. Finally, in Felicity, we can immerse ourselves in Oliver's love poems. Here, great happiness abounds. Our most delicate chronicler of physical landscape, Oliver has described her work as loving the world. With Felicity she examines what it means to love another person. She opens our eyes again to the territory within our own hearts; to the wild and to the quiet. In these poems, she describes - with joy - the strangeness and wonder of human connection.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0245797_9781472153739_300.jpeg","name":"Felicity","author":"Mary Oliver","BookUrl":"https://www.dubraybooks.ie/Felicity_9781472153739","PublishDate":"05/04/2018"}
{"_id":"9781472153760","category":"Poetry","decription":"I go down to the shore in the morningand depending on the hour the wavesare rolling in or moving out, and I say, oh, I am miserable,what shall-what should I do? And the sea saysin its lovely voice:Excuse me, I have work to do.Whether studying the leaves of a tree or mourning her treasured dog Percy, Mary Oliver is beautifully open to the teachings contained within the smallest of moments. In  A Thousand Mornings she explores, with startling clarity, humour and kindness, the mysteries of our daily experience.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0245799_9781472153760_300.jpeg","name":"Thousand Mornings","author":"Mary Oliver","BookUrl":"https://www.dubraybooks.ie/Thousand-Mornings_9781472153760","PublishDate":"05/04/2018"}
{"_id":"9781473695900","category":"Poetry","decription":"The literary equivalent to a comforting bath before bed, this beautiful anthology of short tales and poems will calm and restore an anxious mind before sleep.A good night's sleep is fundamental to our well being and our health, yet in our busy world,  dominated by screens,  and juggling the demands of home and work, our sleep is often poor and overlooked.  Now is the time to stop a while, and be reminded that while memories of bedtime stories as children may be distant, the comfort to be found in disappearing into a good story never goes away.Whether you love classic short stories by authors like Oscar Wilde, Guy de Maupassant or Katherine Mansfield, or fairy tales from distant shores, or poetry that reminds you of the joyful things in life, this carefully curated book is aimed at soothing the frazzled grown-up mind and preparing you for a good night's sleep.So switch off, snuggle down and allow yourself to escape into new worlds and old; magical, mysterious and tender realms that will accompany you to your own sweet dreams.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0254728_9781473695900_300.jpeg","name":"Bedtime Stories for Stressed Out Adults","author":"Various","BookUrl":"https://www.dubraybooks.ie/Bedtime-Stories-for-Stressed-Out-Adults_9781473695900","PublishDate":"18/10/2018"}
{"_id":"9781788161732","category":"Poetry","decription":"You Know How a CatWill Bring a mouse it hascaught and lay it at yourfeet so each morning Ibring you a poem thatI've written when I wokeup in the night as my tributeto your beauty &a promise of my love.-James LaughlinAcross the ages, cats have provided   their adopted humans with companionship, affection, mystery, and innumerable   metaphors.Cats raise a mirror up to their   beholders; cats endlessly captivate and hypnotise, frustrate and delight. To   poets, in particular, these enigmatic creatures are the most delightful and   beguiling of muses, as they purr, prowl, hunt, play, meow, and nap, often   oblivious to their so-called masters. Cat Poems offers a litter of odes to our beloved felines by some of the greatest poets of all time.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256856_9781788161732_300.jpeg","name":"Cat Poems","author":"Elizabeth Bishop","BookUrl":"https://www.dubraybooks.ie/Cat-Poems_9781788161732","PublishDate":"04/10/2018"}
{"_id":"9781472153746","category":"Poetry","decription":"Maybe our world will grow kinder eventually.Maybe the desire to make something beautifulis the piece of God that is inside each of us.In this stunning collection, Mary Oliver returns to the imagery that has defined her life's work. Herons, sparrows, owls and kingfishers flit across the page in meditations on love, artistry and impermanence. Whether considering a bird's nest, the seeming patience of oak trees or the paintings of Franz Marc, Mary Oliver reminds us of the transformative power of attention and how much can be contained within the smallest moments.Blue Horses asks what it truly means to belong to this world and to live in it attuned to all its changes. 'To be human,' she shows us, 'is to sing your own song'.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0245798_9781472153746_300.jpeg","name":"Blue Horses","author":"Mary Oliver","BookUrl":"https://www.dubraybooks.ie/Blue-Horses_9781472153746","PublishDate":"05/04/2018"}
{"_id":"9781509814374","category":"Poetry","decription":"In Poems to Live Your Life By, Chris Riddell, political cartoonist for the Observer, has selected  his very favourite classic and modern poems about life, death and everything in between. This gorgeously illustrated collection includes forty-six poems and is divided into sections covering: musings, youth, family, love, imaginings, nature, war and endings. Chris Riddell brings them to life with his exquisite, intricate artwork in this beautiful anthology. Perfect as a gift, it features famous poems, classics old and new, and a few surprises, Poems to Live Your Life By includes poems from William Shakespeare, Lewis Carroll, Nick Cave, Leonard Cohen, Carol Ann Duffy and Christina Rossetti sitting alongside Neil Gaiman, Roger McGough and W. B. Yeats.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257028_9781509814374_300.jpeg","name":"Poems to Live Your Life By","author":"Chris Riddell","BookUrl":"https://www.dubraybooks.ie/Poems-to-Live-Your-Life-By_9781509814374","PublishDate":"20/09/2018"}
{"_id":"9780007902361","category":"Poetry","decription":"HarperCollins is proud to present its new range of best-loved, essential classics. 'Did my heart love till now? Forswear it, sight! For I ne'er saw true beauty till this night.' Arguably the greatest love story ever told, Shakespeare's Romeo and Juliet continues to touch modern audiences with its passionate depiction of the tragic romance between two young lovers. With a bitter feud between their respective families, Romeo and Juliet's love is troubled from the start, and through their relationship, Shakespeare shows the fine line between love, hatred, comedy and tragedy.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0076270_9780007902361_300.jpeg","name":"Romeo and Juliet","author":"William Shakespeare","BookUrl":"https://www.dubraybooks.ie/Romeo-and-Juliet_9780007902361","PublishDate":"15/09/2011"}
{"_id":"9780007902347","category":"Poetry","decription":"HarperCollins is proud to present its new range of best-loved, essential classics. 'Though this be madness, yet there is method in't.' Considered one of Shakespeare's most rich and enduring plays, the depiction of its hero Hamlet as he vows to avenge the murder of his father by his brother Claudius is both powerful and complex. As Hamlet tries to find out the truth of the situation, his troubled relationship with his mother comes to the fore, as do the paradoxes in his personality. A play of carefully crafted conflict and tragedy, Shakespeare's intricate dialogue continues to fascinate audiences to this day.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0076269_9780007902347_300.jpeg","name":"Hamlet","author":"William Shakespeare","BookUrl":"https://www.dubraybooks.ie/Hamlet_9780007902347","PublishDate":"15/09/2011"}
{"_id":"9781471165825","category":"Poetry","decription":"From Rupi Kaur, the top ten Sunday Times bestselling author of 'Milk and Honey', comes her long-awaited second collection of poetry. Illustrated by Kaur, 'The Sun and Her Flowers' is a journey of wilting, falling, rooting, rising and blooming. It is a celebration of love in all its forms.  \"'This is the recipe of life' said my mother as she held me in her arms as I wept 'Think of those flowers you plantin the garden each year they will teach you that people too must wilt fall root rise in order to bloom\"\n\nPraise for Sunday Times bestseller 'Milk and Honey': \n`Kaur is at the forefront of a poetry renaissance'  Observer \n`Kaur made her name with poems about love, life and grief. They resonate hugely' Sunday Times \n`Poems tackling feminism, love, trauma and healing in short lines as smooth as pop music' New York Times \n`Caught the imagination of a large, atypical poetry audience...Kaur knows the good her poetry does: it saves lives' Evening Standard \n`Breathing new life into poetry...It has people reading, and listening' The Pool","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258592_9781471165825_300.jpeg","name":"The Sun and her Flowers","author":"Rupi Kaur","BookUrl":"https://www.dubraybooks.ie/The-Sun-and-her-Flowers_9781471165825","PublishDate":"01/10/2017"}
{"_id":"9781509899425","category":"Poetry","decription":"She is Fierce: Brave, Bold and Beautiful Poems by Women is a powerful collection of 150 poems written by women - from classic, much loved poets to bold modern voices.  Collected by poet Ana Sampson, this collection celebrates the centenary of women's suffrage at a time when we are still having important conversations about women's right to be treated as equals. It speaks of universal experiences and emotions. The anthology is divided into the following sections:Roots and Growing Up FriendshipLoveNature Freedom, Mindfulness and JoyFashion, society and body image Protest, courage and resistanceEndings She is Fierce contains an inclusive array of voices, from modern and contemporary poets such as Maya Angelou and Grace Nichols to poets from previous centuries including  Emily Dickinson, Christina Rossetti, Ella Wheeler Wilcox and Charlotte Bronte. Immerse yourself in poems from Wendy Cope, Carol Ann Duffy, Fleur Adcock,  Liz Berry, Jackie Kay, Hollie McNish, Imtiaz Dharker, Helen Dunmore, Mary Oliver and Dorothy Parker, to name but a few!Featuring short biographies of each poet, She is Fierce is a stunning collection and an essential addition to any bookshelf.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257033_9781509899425_300.jpeg","name":"She is Fierce","author":"Ana Sampson","BookUrl":"https://www.dubraybooks.ie/She-is-Fierce_9781509899425","PublishDate":"06/09/2018"}
{"_id":"9781408883440","category":"Science Fiction & Fantasy","decription":"Ruled by a queen without an heir, The West is under attack, while The East waits for a new generation of Dragon Riders to rise. In this divided world, no one is safe when the Nameless One is about to awaken, and it’s up to a group of unlikely heroes to save the world as they know it. Shannon has created a lush, ambitious, epic fantasy full of magic, dragons and adventure, with characters who come alive from the page. Simply outstanding!\n\n- Recommended by Gabriela Pop, Dun Laoghaire\n\nFrom the internationally bestselling author of The Bone Season, a trailblazing, epic high fantasy about a world on the brink of war with dragons - and the women who must lead the fight to save it.A world divided.A queendom without an heir.An ancient enemy awakens.The House of Berethnet has ruled Inys for a thousand years. Still unwed, Queen Sabran the Ninth must conceive a daughter to protect her realm from destruction - but assassins are getting closer to her door. Ead Duryan is an outsider at court. Though she has risen to the position of lady-in-waiting, she is loyal to a hidden society of mages. Ead keeps a watchful eye on Sabran, secretly protecting her with forbidden magic.Across the dark sea, Tane has trained to be a dragonrider since she was a child, but is forced to make a choice that could see her life unravel.Meanwhile, the divided East and West refuse to parley, and forces of chaos are rising from their sleep.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262124_9781408883440_300.jpeg","name":"The Priory of the Orange Tree","author":"Samantha Shannon","BookUrl":"https://www.dubraybooks.ie/The-Priory-of-the-Orange-Tree_9781408883440","PublishDate":"26/02/2019"}
{"_id":"9780552159845","category":"Science Fiction & Fantasy","decription":"'Armageddon only happens once, you know. They don't let you go around again until you get it right'. People have been predicting the end of the world almost from its very beginning, so it's only natural to be skeptical when a new date is set for Judgement Day. But what if, for once, the predictions are right, and the apocalypse really is due to arrive next Saturday, just after tea? You could spend the time left drowning your sorrows, giving away all your possessions in preparation for the rapture, or laughing it off as (hopefully) just another hoax. Or you could just try to do something about it.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/010/0103327_9780552159845_300.jpeg","name":"Good Omens","author":"Neil Gaiman","BookUrl":"https://www.dubraybooks.ie/Good-Omens_9780552159845","PublishDate":"07/01/2010"}
{"_id":"9780575081406","category":"Science Fiction & Fantasy","decription":"'I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe. You may have heard of me' So begins the tale of Kvothe - currently known as Kote, the unassuming innkeepter - from his childhood in a troupe of traveling players, through his years spent as a near-feral orphan in a crime-riddled city, to his daringly brazen yet successful bid to enter a difficult and dangerous school of magic. In these pages you will come to know Kvothe the notorious magician, the accomplished thief, the masterful musician, the dragon-slayer, the legend-hunter, the lover, the thief and the infamous assassin. The Name of the Wind is fantasy at its very best, and an astounding must-read title.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0097857_9780575081406_300.jpeg","name":"The Name of the Wind","author":"Patrick Rothfuss","BookUrl":"https://www.dubraybooks.ie/The-Name-of-the-Wind_9780575081406","PublishDate":"12/06/2008"}
{"_id":"9781408891957","category":"Science Fiction & Fantasy","decription":"THE NO. 1 SUNDAY TIMES AND NEW YORK TIMES BESTSELLER `With the deftest of touches, the characters are once again brought to life' JOANNE HARRIS`The halls of Valhalla have been crying out for Gaiman to tell their stories' OBSERVERThe great Norse myths, which have inspired so much of modern fiction, are dazzlingly retold by Neil Gaiman. Tales of dwarfs and frost giants, of treasure and magic, and of Asgard, home to the gods: Odin the all-father, highest and oldest of the Aesir; his mighty son Thor, whose hammer Mjollnir makes the mountain giants tremble; Loki, wily and handsome, reliably unreliable in his lusts; and Freya, more beautiful than the sun or the moon, who spurns those who seek to control her. From the dawn of the world to the twilight of the gods, this is a thrilling, vivid retelling of the Norse myths from the award-winning, bestselling Neil Gaiman.*This book has been printed with two different cover designs. We are unable to accept requests for a specific cover. The different covers will be assigned to orders at random*","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0246101_9781408891957_300.jpeg","name":"Norse Mythology","author":"Neil Gaiman","BookUrl":"https://www.dubraybooks.ie/Norse-Mythology_9781408891957","PublishDate":"06/03/2018"}
{"_id":"9780340960196","category":"Science Fiction & Fantasy","decription":"Before The Matrix, before Star Wars, before Ender's Game and Neuromancer, there was Dune: winner of the prestigious Hugo and Nebula awards, and widely considered one of the greatest science fiction novels ever written. Melange, or 'spice', is the most valuable - and rarest - element in the universe; a drug that does everything from increasing a person's life-span to making intersteller travel possible. And it can only be found on a single planet: the inhospitable desert world Arrakis. Whoever controls Arrakis controls the spice. And whoever controls the spice controls the universe. When the Emperor transfers stewardship of Arrakis from the noble House Harkonnen to House Atreides, the Harkonnens fight back, murdering Duke Leto Atreides. Paul, his son, and Lady Jessica, his concubine, flee into the desert. On the point of death, they are rescued by a band for Fremen, the native people of Arrakis, who control Arrakis' second great resource: the giant worms that burrow beneath the burning desert sands. In order to avenge his father and retake Arrakis from the Harkonnens, Paul must earn the trust of the Fremen and lead a tiny army against the innumerable forces aligned against them.And his journey will change the universe.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/016/0165235_9780340960196_300.jpeg","name":"Dune","author":"Frank Herbert","BookUrl":"https://www.dubraybooks.ie/Dune_9780340960196","PublishDate":"16/07/2015"}
{"_id":"9780755384792","category":"Science Fiction & Fantasy","decription":"THE NO.1 SUNDAY TIMES AND NEW YORK TIMES HARDBACK BESTSELLER Fall under the spell of Diana and Matthew once more in the stunning climax to their epic tale, following A DISCOVERY OF WITCHES and SHADOW OF NIGHT. A world of witches, daemons and vampires. A manuscript which holds the secrets of their past and the key to their future. Diana and Matthew - the forbidden love at the heart of it. After travelling through time in SHADOW OF NIGHT, the second book in Deborah Harkness's enchant-ing series, historian and witch Diana Bishop and vampire scientist Matthew Clairmont return to the present to face new crises and old enemies. At Matthew's ancestral home in France they reunite with their families - with one heart-breaking exception. But the real threat to their future is yet to be revealed, and when it is, the search for the elusive manuscript Ashmole 782 and its missing pages takes on a terrifying urgency. Using ancient knowl-edge and modern science, from the palaces of Venice and beyond, Diana and Matthew will finally learn what the witches discovered so many centuries ago.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/016/0164085_9780755384792_300.jpeg","name":"The Book of Life","author":"Deborah Harkness","BookUrl":"https://www.dubraybooks.ie/The-Book-of-Life_9780755384792","PublishDate":"09/04/2015"}
{"_id":"9780007548231","category":"Science Fiction & Fantasy","decription":"HBO's hit series A GAME OF THRONES is based on George R R Martin's internationally bestselling series A SONG OF ICE AND FIRE, the greatest fantasy epic of the modern age. A GAME OF THRONES is the first volume in the series. Summers span decades. Winter can last a lifetime. And the struggle for the Iron Throne has begun. As Warden of the north, Lord Eddard Stark counts it a curse when King Robert bestows on him the office of the Hand. His honour weighs him down at court where a true man does what he will, not what he must ...and a dead enemy is a thing of beauty. The old gods have no power in the south, Stark's family is split and there is treachery at court. Worse, the vengeance-mad heir of the deposed Dragon King has grown to maturity in exile in the Free Cities. He claims the Iron Throne.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0076053_9780007548231_300.jpeg","name":"A Game of Thrones: Book 1 of a Song of Ice and Fire","author":"George R. R. Martin","BookUrl":"https://www.dubraybooks.ie/A-Game-of-Thrones-Book-1-of-a-Song-of-Ice-and-Fire_9780007548231","PublishDate":"27/03/2014"}
{"_id":"9780330545754","category":"Science Fiction & Fantasy","decription":"Young Corban watches enviously as boys become warriors, learning the art of war. He yearns to wield his sword and spear to protect his king's realm. But that day will come all too soon. Only when he loses those he loves will he learn the true price of courage. The Banished Lands has a violent past where armies of men and giants clashed in battle, the earth running dark with their heartsblood. Although the giant-clans were broken in ages past, their ruined fortresses still scar the land. But now giants stir anew, the very stones weep blood and there are sightings of giant wyrms. Those who can still read the signs see a threat far greater than the ancient wars. Sorrow will darken the world, as angels and demons make it their battlefield. Then there will be a war to end all wars. High King Aquilus summons his fellow kings to council, seeking an alliance in this time of need. Prophesy indicates darkness and light will demand two champions, the Black Sun and the Bright Star. They would be wise to seek out both, for if the Black Sun gains ascendancy, mankind's hopes and dreams will fall to dust.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0090804_9780330545754_300.jpeg","name":"Malice: Book One of the Faithful and the Fallen","author":"John Gwynne","BookUrl":"https://www.dubraybooks.ie/Malice-Book-One-of-the-Faithful-and-the-Fallen_9780330545754","PublishDate":"04/07/2013"}
{"_id":"9780007264865","category":"Science Fiction & Fantasy","decription":"A new novel from internationally bestselling author Raymond E. Feist.          The world of Garn once boasted five great kingdoms, until the King of Ithrace was defeated and every member of his family executed by Lodavico, the ruthless King of Sandura, a man with ambitions to rule the world.          Ithrace's ruling family were the legendary Firemanes, and represented a great danger to the other kings. Now four great kingdoms remain, on the brink of war. But rumour has it that the newborn son of the last king of Ithrace survived, carried off during battle and sequestered by the Quelli Nacosti, a secret society whose members are trained to infiltrate and spy upon the rich and powerful throughout Garn. Terrified that this may be true, and that the child will grow to maturity with bloody revenge in his heart, the four kings have placed a huge bounty on the child's head.          In the small village of Oncon, Declan is apprenticed to a master blacksmith, learning the secrets of producing the mythical king's steel. Oncon is situated in the Covenant, a neutral region lying between two warring kingdoms. Since the Covenant was declared, the region has existed in peace, until violence explodes as slavers descend upon the village to capture young men to press as soldiers for Sandura.          Declan must escape, to take his priceless knowledge to Baron Daylon Dumarch, ruler of Marquensas, perhaps the only man who can defeat Lodavico of Sandura, who has now allied himself with the fanatical Church of the One, which is marching across the continent, imposing its extreme form of religion upon the population and burning unbelievers as they go.          Meanwhile, on the island of Coaltachin, the secret domain of the Quelli Nacosti, three friends are being schooled in the deadly arts of espionage and assassination: Donte, son of one of the most powerful masters of the order; Hava, a serious girl with fighting abilities that can set any opponent on their back; and Hatu, a strange, conflicted lad in whom fury and calm war constantly, whose hair is a bright and fiery shade of red...","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262023_9780007264865_300.jpeg","name":"King of Ashes","author":"Raymond E. Feist","BookUrl":"https://www.dubraybooks.ie/King-of-Ashes_9780007264865","PublishDate":"07/02/2019"}
{"_id":"9781473223110","category":"Science Fiction & Fantasy","decription":"Two sisters become unwitting rivals in a war to claim the title of Emperor in this sweeping tale of ambition, sacrifice and betrayal for readers of Tomi Adeyemi, Sabaa Tahir and Alwyn Hamilton.All hail the Girl KingSisters Lu and Min have always understood their places as princesses of the Empire. Lu knows she is destined to become the dynasty's first female ruler, while Min is resigned to a life in her shadow. Then their father declares their male cousin Set the heir instead - a betrayal that sends the sisters down two very different paths.  Determined to reclaim her birthright, Lu goes on the run. She needs an ally - and an army - if she is to succeed. Her quest leads her to Nokhai, the last surviving wolf shapeshifter. Nok wants to keep his identity secret, but finds himself forced into an uneasy alliance with the girl whose family killed everyone he ever loved . . . Alone in the volatile court, Min's hidden power awakens - a forbidden, deadly magic that could secure Set's reign . . . or allow Min to claim the throne herself. But there can only be one Emperor, and the sisters' greatest enemy could turn out to be each other.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0261097_9781473223110_300.jpeg","name":"Girl King","author":"Mimi Yu","BookUrl":"https://www.dubraybooks.ie/Girl-King_9781473223110","PublishDate":"08/01/2019"}
{"_id":"9781844132393","category":"Philosophy","decription":"A prominent Viennese psychiatrist before the war, Viktor Frankl was uniquely able to observe the way that both he and others in Auschwitz coped (or didn't) with the experience. He noticed that it was the men who comforted others and who gave away their last piece of bread who survived the longest - and who offered proof that everything can be taken away from us except the ability to choose our attitude in any given set of circumstances. The sort of person the concentration camp prisoner became was the result of an inner decision and not of camp influences alone. Frankl came to believe man's deepest desire is to search for meaning and purpose. This outstanding work offers us all a way to transcend suffering and find significance in the art of living.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/013/0137946_9781844132393_300.jpeg","name":"Man's Search for Meaning: The Classic Tribute to Hope from the Holocaust","author":"Viktor E. Frankl","BookUrl":"https://www.dubraybooks.ie/Mans-Search-for-Meaning-The-Classic-Tribute-to-Hope-from-the-Holocaust_9781844132393","PublishDate":"06/05/2004"}
{"_id":"9780140449334","category":"Philosophy","decription":"Originally written only for his personal consumption, Marcus Aurelius' \"Meditations\" has become a key text in the understanding of Roman Stoic philosophy. This \"Penguin Classics\" edition is translated with notes by Martin Hammond and an introduction by Diskin Clay. Written in Greek by an intellectual Roman emperor without any intention of publication, the \"Meditations of Marcus Aurelius\" offer a wide range of fascinating spiritual reflections and exercises developed as the leader struggled to understand himself and make sense of the universe. Spanning from doubt and despair to conviction and exaltation, they cover such diverse topics as the question of virtue, human rationality, the nature of the gods and Aurelius' own emotions.  But while the \"Meditations\" were composed to provide personal consolation, in developing his beliefs Marcus also created one of the greatest of all works of philosophy: a series of wise and practical aphorisms that have been consulted and admired by statesmen, thinkers and ordinary readers for almost two thousand years.Martin Hammond's new translation fully expresses the intimacy and eloquence of the original work, with detailed notes elucidating the text. This edition also includes an introduction by Diskin Clay, exploring the nature and development of the \"Meditations\", a chronology, further reading and full indexes. Marcus Aelius \"Aurelius Antoninus\" (121-80) was adopted by the emperor Antoninus Pius and succeeded him in 161, (as joint emperor with adoptive brother Lucius Verus).  He ruled alone from 169, and spent much of his reign in putting down various rebellions, and was a persecutor of Christians. His fame rest, above all, on his \"Meditations\", a series of reflections, strongly influenced by Epictetus, which represent a Stoic outlook on life. He was succeeded by his natural son, thus ending the period of the adoptive emperors. If you enjoyed \"Meditations\", you might like Seneca's \"Letters from a Stoic\", also available in \"Penguin Classics\".","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0078810_9780140449334_300.jpeg","name":"Meditations","author":"Marcus Aurelius","BookUrl":"https://www.dubraybooks.ie/Meditations_9780140449334","PublishDate":"27/04/2006"}
{"_id":"9781783784837","category":"Philosophy","decription":"All cultures are different, and have different ways of thinking.  In How the World Thinks, Julian Baggini travels the globe to provide a hugely wide-ranging map of human thought. He shows us how distinct branches of philosophy flowered simultaneously in China, India and Ancient Greece, growing from local myths and stories - and how contemporary cultural attitudes, with particular attention to the West, East Asia, the Muslim World and Africa, have developed out of the philosophical histories of their regions. Interviewing thinkers from all around the world, he asks why, for instance, do our European systems of governments and justice differ so widely from the East? Why can Islam not easily incorporate secular knowledge? How do we understand China? By gaining greater knowledge of how others think, we can become less certain of the knowledge we think we have, the first step to greater understanding.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257283_9781783784837_300.jpeg","name":"How the World Thinks: A Global History of Philosophy","author":"Julian Baggini","BookUrl":"https://www.dubraybooks.ie/How-the-World-Thinks-A-Global-History-of-Philosophy_9781783784837","PublishDate":"04/10/2018"}
{"_id":"9780099598169","category":"Philosophy","decription":"Acclaimed as one of the most exciting books in the history of American letters, this modern epic became an instant bestseller upon publication in 1974, transforming a generation and continuing to inspire millions. A narration of a summer motorcycle trip undertaken by a father and his son, the book becomes a personal and philosophical odyssey into fundamental questions of how to live. Resonant with the confusions of existence, Zen and the Art of Motorcycle Maintenance is a touching and transcendent book of life.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/008/0080704_9780099598169_300.jpeg","name":"Zen And The Art Of Motorcycle Maintenance","author":"Robert M. Pirsig","BookUrl":"https://www.dubraybooks.ie/Zen-And-The-Art-Of-Motorcycle-Maintenance_9780099598169","PublishDate":"11/09/2014"}
{"_id":"9780241341179","category":"Philosophy","decription":"Learn everything you need to know about the world of philosophy- from the key thinkers to modern concepts in a brand new portable size.To the complete novice learning about philosophy can be daunting - The Little Book of Philosophy changes all that. With the use of powerful and easy-to-follow images, famous quotations, and explanations that are easily understandable, this book cuts through any misunderstandings to demystify the subject.Each chapter is organised chronologically, and covers not only the big ideas, but the philosophers who first voiced them, as well as cross-referencing with earlier and later ideas and thinkers. The Little Book of Philosophy  untangles knotty theories and sheds light on abstract concepts, and is perfect for anyone with a general interest in how our social, political, and ethical ideas are formed, as well as students of philosophy and politics.Covers major and niche topics, from moral ethics to philosophies of religion.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0249628_9780241341179_300.jpeg","name":"Big Ideas: The Little Book of Philosophy","author":"DK","BookUrl":"https://www.dubraybooks.ie/Big-Ideas-The-Little-Book-of-Philosophy_9780241341179","PublishDate":"07/06/2018"}
{"_id":"9780416199253","category":"Philosophy","decription":"Winnie-the-Pooh is 'The Bear for all Ages', and now he's more fun than ever before. Join in The Tao of Pooh and the Te of Piglet! Pooh's Way of doing things seems strangely close to the ancient principle of Taoist philosophy, while Piglet exhibits the very important principle in Taoism of the Te, meaning Virtue of the Small. The author's explanations of Taoism and Te through Pooh and Piglet show that this is not an ancient and remote philosophy but something that you can use, here and now.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/010/0100297_9780416199253_300.jpeg","name":"Tao of Pooh & the Te of Piglet","author":"Benjamin Hoff","BookUrl":"https://www.dubraybooks.ie/Tao-of-Pooh-amp%3b-the-Te-of-Piglet_9780416199253","PublishDate":"01/06/2002"}
{"_id":"9780593080399","category":"Philosophy","decription":"Known as the `four horsemen' of New Atheism, these four big thinkers of the twenty-first century met only once. Their electrifying examination of ideas on this remarkable occasion was intense and wide-ranging. Everything that was said as they agreed and disagreed with one another, interrogated ideas and exchanged insights  - about religion and atheism, science and sense - speaks with urgency to our present age.  Questions they asked of each other included: `Is it ever possible to win a war of ideas? Is spirituality the preserve of the religious? Are there any truths you would rather not know? Would you want to see the end of faith?'             The dialogue was recorded, and is now transcribed and presented here with new introductions from the surviving three horsemen. With a sparkling introduction from Stephen Fry, it makes essential reading for all their admirers and for anyone interested in exploring the tensions between faith and reason.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0261012_9780593080399_300.jpeg","name":"Four Horsemen","author":"Richard Dawkins (Oxford University)","BookUrl":"https://www.dubraybooks.ie/Four-Horsemen_9780593080399","PublishDate":"14/02/2019"}
{"_id":"9781847493231","category":"Philosophy","decription":"At the end of an industrious political career in conflict-riven Italy, the Florentine diplomat Niccolo Machiavelli composed his masterpiece The Prince, a classic study of power and politics, and a manual of ruthlessness for any ambitious ruler.  Controversial in his own time, The Prince made Machiavelli's name a byword for manipulative scheming, and had an impact on such major figures as Napoleon and Frederick the Great. It contains principles as true today as when they were first written almost five centuries ago.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/015/0157409_9781847493231_300.jpeg","name":"The Prince","author":"Niccolo Machiavelli","BookUrl":"https://www.dubraybooks.ie/The-Prince_9781847493231","PublishDate":"12/09/2013"}
{"_id":"9780753813591","category":"Philosophy","decription":"Thinking about life, what it means and what it holds in store does not have to be a despondent experience, but rather can be enlightening and uplifting.  A life truly worth living is one that is informed and considered so a degree of philosophical insight into the inevitabilities of the human condition is inherently important and such an approach will help us to deal with real personal dilemmas.  This book is an accessible, lively and thought-provoking series of linked commentaries, based on A. C. Grayling's 'The Last Word' column in the Guardian.  Its aim is not to persuade readers to accept one particular philosophical point of view or theory, but to help us consider the wonderful range of insights which can be drawn from an immeasurably rich history of philosophical thought. Concepts covered include courage, love, betrayal, ambition, cruelty, wisdom, passion, beauty and death.  This will be a wonderfully stimulating read and act as an invaluable guide as to what is truly important in living life, whether facing success, failure, justice, wrong, love, loss or any of the other profound experience life throws out.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0098448_9780753813591_300.jpeg","name":"The Meaning of Things: Applying Philosophy to Life","author":"A. C. Grayling","BookUrl":"https://www.dubraybooks.ie/The-Meaning-of-Things-Applying-Philosophy-to-Life_9780753813591","PublishDate":"04/07/2002"}
{"_id":"9781405353298","category":"Philosophy","decription":"This is an innovative and accessible guide to more than 2,000 years of thought. To the complete novice learning about philosophy can be daunting - \"The Philosophy Book\" changes all that. With the use of powerful and easy-to-follow images, succinct quotations, and explanations that are easily understandable, this book cuts through any misunderstandings to demystify the subject. Each chapter is organised chronologically, and covers not only the big ideas, but the philosophers who first voiced them, as well as cross-referencing with earlier and later ideas and thinkers. \"The Philosophy Book\" untangles knotty theories and sheds light on abstract concepts, and is perfect for anyone with a general interest in how our social, political, and ethical ideas are formed, as well as students of philosophy and politics. It covers major and niche topics, from moral ethics to philosophies of religion.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/011/0111237_9781405353298_300.jpeg","name":"The Philosophy Book","author":"DK","BookUrl":"https://www.dubraybooks.ie/The-Philosophy-Book_9781405353298","PublishDate":"31/01/2011"}
{"_id":"9780717184576","category":"Psychology","decription":"As a psychiatrist, Brendan Kelly is used to doling out prescriptions and advice. This is the story of what happened when he decided to try his own medicine and take up meditation for a year.Can this busy psychiatrist, dad and Buddhism enthusiast improve his life by meditating for 15 minutes every day? Will it improve his relationships with his family and patients? Will he find inner peace and, if so, how will he know that he has? Will he ever be more mindful than Trixie, the cat that peacefully observes his daily practice, always seeming more zen than the meditating doctor?This is the journal of a self-confessed `Zen failure' who believes there is much to be said for sitting quietly but soon realises that there are also many distractions. The Doctor Who Sat for a Year is a funny, thoughtful and inspiring book about embracing both mediation and our imperfections. `The world is full of mystery, but here's something we know: meditation is the best way to harness the power of the human mind. And this book tells us how.' Uri Geller, www.urigeller.com`Like many of us, Brendan Kelly has an on/off relationship with meditation. His everyday diary describing varying degrees of success and failure to meditate has a captivating intimacy. Whether a recidivist meditator or committed practitioner, you will enjoy this book.' Dr Muiris Houston, Medical Journalist and Health Analyst with the Irish Times and Adjunct Professor Narrative Medicine, Trinity College Dublin `An excellent introduction to the path of meditation ... The author describes both how difficult meditation can be in the face of daily distractions and, ultimately, how easy it becomes when simple choices are put in place.' Michael Harding","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0265137_9780717184576_300.jpeg","name":"The Doctor Who Sat for a Year","author":"Brendan Kelly","BookUrl":"https://www.dubraybooks.ie/The-Doctor-Who-Sat-for-a-Year_9780717184576","PublishDate":"01/03/2019"}
{"_id":"9780099592549","category":"Psychology","decription":"'I emerged from this book feeling better about almost everything... a mosaic of faces building into this extraordinary portrait of our species.' Guardian'The Ten Types of Human is a fantastic piece of non-fiction, mixing astonishing real-life cases with the latest scientific research to provide a guide to who we really are. It's inspiring and essential.' Charles Duhigg'Uplifting and indispensable.' Howard Cunnell This book will introduce you to ten people.  In a way, you already know them.  Only you don't - not really.  In a sense, they are you.  Only they're not entirely.  They inform and shape the most important decisions in your life. But you're almost certainly unaware of their intervention. They are the Ten Types of Human.  Who are they?  What are they for?  How did they get into your head? We want to believe that there are some things we would never do. We want to believe that there are others we always would. But how can we be sure? What are our limits? Do we have limits?The answer lies with the Ten Types of Human: the people we become when we are faced with life's most difficult decisions. But who or what are these Types? Where do they come from? How did they get into our heads? The Ten Types of Human is a pioneering examination of human nature. It looks at the best and worst that human beings are capable of, and asks why. It explores the frontiers of the human experience, excavating the forces that shape our thoughts and actions in extreme situations. It begins in a courtroom and journeys across four continents and through the lives of some exceptional people, in search of answers. Mixing cutting-edge neuroscience, social psychology and human rights research, The Ten Types of Human is at once a provocation and a map to our hidden selves.  It provides a new understanding of who we are - and who we can be.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0246912_9780099592549_300.jpeg","name":"The Ten Types of Human: A New Understanding of Who We Are, and Who We Can Be","author":"Dexter Dias","BookUrl":"https://www.dubraybooks.ie/The-Ten-Types-of-Human-A-New-Understanding-of-Who-We-Are-and-Who-We-Can-Be_9780099592549","PublishDate":"19/04/2018"}
{"_id":"9780141982656","category":"Psychology","decription":"From the bestselling author of The Black Swan, a bold book that challenges many of our long-held beliefs about risk and reward, politics and religion, finance and personal responsibility'Skin in the game means that you do not pay attention to what people say, only to what they do, and how much of their neck they are putting on the line'Citizens, artisans, police, fishermen, political activists and entrepreneurs all have skin in the game. Policy wonks, corporate executives, many academics, bankers and most journalists don't. It's all about having something to lose and sharing risks with others. In his most provocative and practical book yet, Nassim Nicholas Taleb shows that skin in the game, often seen as the foundation of risk management, in fact applies to all aspects of our lives. In his inimitable style, Taleb draws on everything from Antaeus the Giant to Hammurabi to Donald Trump, from ethics to used car salesmen, to create a jaw-dropping framework for understanding this idea. Among his insights:For social justice, focus on symmetry and risk sharing.Minorities, not majorities, run the world. You can be an intellectual yet still be an idiot. Beware of complicated solutions (that someone was paid to find). Just as The Black Swan did during the 2007 financial crisis, Skin in the Game comes at precisely the right moment to challenge our long-held beliefs about risk, reward, politics, religion and business - and make us rethink everything we thought we knew.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0260952_9780141982656_300.jpeg","name":"Skin in the Game","author":"Nassim Nicholas Taleb","BookUrl":"https://www.dubraybooks.ie/Skin-in-the-Game_9780141982656","PublishDate":"28/02/2019"}
{"_id":"9780241317945","category":"Psychology","decription":"**From the author of the Sunday Times bestselling The 4 Pillar Plan**\"It's thought that between 70 and 90% of GP consultations are related to stress\"This has to change.Dr Rangan Chatterjee knows this better than anyone. As a practising GP he's seen first-hand how stress affects his patients and has found simple but effective methods to help them.Now he's on a mission to show that combatting stress is easier than you think.He shows how a small change in the way you approach yourBODYMINDRELATIONSHIPSPURPOSEcan help you lead a more fulfilled, calmer life.In The Stress Solution, Rangan offers simple and achievable interventions to help you re-set your life, offering simple tools for how to cope with modern-life, including:*         How to design your morning routine effectively*         How to keep a touch diary*         How to mute your digital world and make maoi mates*         How to eat the alphabetPacked with personal accounts and patient cases, this book will become your blueprint on how to live stress-free in the modern world.\"Rangan's easy, common-sense plan can help everyone live a happier, healthier life\" - Jamie Oliver on The 4 Pillar Plan","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257589_9780241317945_300.jpeg","name":"Stress Solution","author":"Dr Rangan Chatterjee","BookUrl":"https://www.dubraybooks.ie/Stress-Solution_9780241317945","PublishDate":"27/12/2018"}
{"_id":"9780141033570","category":"Psychology","decription":"The \"New York Times\" Bestseller, acclaimed by author such as Freakonomics co-author Steven D. Levitt, Black Swan author Nassim Nicholas Taleb and Nudge co-author Richard Thaler, \"Thinking Fast and Slow\" offers a whole new look at the way our minds work, and how we make decisions. Why is there more chance we'll believe something if it's in a bold type face? Why are judges more likely to deny parole before lunch? Why do we assume a good-looking person will be more competent? The answer lies in the two ways we make choices: fast, intuitive thinking, and slow, rational thinking. This book reveals how our minds are tripped up by error and prejudice (even when we think we are being logical), and gives you practical techniques for slower, smarter thinking. It will enable to you make better decisions at work, at home, and in everything you do.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/017/0174200_9780141033570_300.jpeg","name":"Thinking, Fast and Slow","author":"Daniel Kahneman","BookUrl":"https://www.dubraybooks.ie/Thinking-Fast-and-Slow_9780141033570","PublishDate":"10/05/2012"}
{"_id":"9780241257401","category":"Psychology","decription":"Every time we are introduced to someone new, try to be creative, or start a difficult conversation, we take a risk. We feel uncertain and exposed. We feel vulnerable. Most of us try to fight those feelings - we strive to appear perfect. In a powerful new vision Dr. Brene Brown challenges everything we think we know about vulnerability, and dispels the widely accepted myth that it's a weakness. She argues that, in truth, vulnerability is strength and when we shut ourselves off from vulnerability - from revealing our true selves - we distance ourselves from the experiences that bring purpose and meaning to our lives. Daring Greatly is the culmination of 12 years of groundbreaking social research, across every area of our lives including home, relationships, work, and parenting. It is an invitation to be courageous; to show up and let ourselves be seen, even when there are no guarantees. This is vulnerability. This is daring greatly.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/020/0201741_9780241257401_300.jpeg","name":"Daring Greatly: How the Courage to be Vulnerable Transforms the Way We Live, Love, Parent, and Lead","author":"Brene Brown","BookUrl":"https://www.dubraybooks.ie/Daring-Greatly-How-the-Courage-to-be-Vulnerable-Transforms-the-Way-We-Live-Love-Parent-and-Lead_9780241257401","PublishDate":"03/12/2015"}
{"_id":"9781408878729","category":"Psychology","decription":"THE SUNDAY TIMES BESTSELLERTHE NEW YORK TIMES BESTSELLER`Brilliant for anyone wanting a better understanding of mental health' ZOE BALL`This amazing book will change your life' ELTON JOHN`Eye-opening' Guardian `Important' Matt Haig  `Wonderful' Hillary Clinton `A game-changer' Davina McCall `Extraordinary' Dr Max Pemberton`Beautiful' Russell Brand Depression and anxiety are now at epidemic levels. Why? Across the world, scientists have uncovered evidence for nine different causes. Some are in our biology - but most are factors in the way we are living.  Johann Hari's ground-breaking bestseller offers a radical new way of thinking about this crisis. Lost Connections shows that once we understand the real causes, we can begin to turn to pioneering new solutions - ones that offer real hope.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0261494_9781408878729_300.jpeg","name":"Lost Connections","author":"Johann Hari","BookUrl":"https://www.dubraybooks.ie/Lost-Connections_9781408878729","PublishDate":"02/01/2019"}
{"_id":"9781471179396","category":"Psychology","decription":"NEW EDITION - Includes never-before-published commentary from the author The Power of Your Subconscious Mind introduces and explains the mind-focusing techniques that remove the subconscious obstacles that prevent us from achieving the success we want - and deserve. This authorised edition of Dr. Murphy's keystone work is the first premium mass market edition to feature additional commentary drawn from his unpublished writings. As practical as it is inspiring, Dr. Murphy's work demonstrates with real-life examples the way to unleash extraordinary mental powers to build self-confidence, create harmonious relationships, gain professional success, amass wealth, conquer fears and phobias, banish bad habits, and even to effect physical healing and promote overall wellbeing and happiness.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0260494_9781471179396_300.jpeg","name":"Power Of Your Subconscious Mind (revised)","author":"Joseph Murphy/ Revised By Ian McMahan","BookUrl":"https://www.dubraybooks.ie/Power-Of-Your-Subconscious-Mind-revised_9781471179396","PublishDate":"10/01/2019"}
{"_id":"9781847946249","category":"Psychology","decription":"In \"The Power of Habit\", award-winning \"New York Times\" business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation. Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains.  We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren's Saddleback Church, NFL locker rooms, and the nation's largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death.At its core, \"The Power of Habit\" contains an exhilarating argument: the key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work. Habits aren't destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/012/0126223_9781847946249_300.jpeg","name":"The Power of Habit: Why We Do What We Do, and How to Change","author":"Charles Duhigg","BookUrl":"https://www.dubraybooks.ie/The-Power-of-Habit-Why-We-Do-What-We-Do-and-How-to-Change_9781847946249","PublishDate":"07/02/2013"}
{"_id":"9781473657601","category":"Psychology","decription":"Through the filtered lens of Instagram, it may seem like life's a peach, but in reality, journalist Caroline Foran has been living with crippling anxiety since her early 20s. Here, in Owning It, she chronicles her journey from the kind of all-consuming fear where leaving the house for milk was too petrifying a prospect, and holding down a high-octane Editor job was no longer possible, to spending every day crying under her duvet, wondering how the hell she was going to pull herself through. But then she did; she owned it. For those facing the same struggle, Caroline explores exactly what anxiety is, its triggers and the various treatments. From CBT, acupuncture, diet and the often debated role of medication - she examines with honesty, humour and a bullsh*t free perspective what worked for her and gives us a no-frills account of anxiety from the front line.  'The hardest lesson and most important I learned was that embracing your anxiety is the key to recovering from it and living a life where it doesn't define you.Don't get me wrong; I still have shitty, stressful days at work, or days when I feel a little below par (one time I was particularly exhausted, ratty and hormonal and I cried because my boyfriend ate my last chicken nugget. I'm 28, I know) - but that, dear friend, is the human experience. What I have now, however, is confidence in myself to pull through whatever life throws at me, thanks to the invisible arsenal of effective tools I keep tucked under my arm.'","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/022/0226450_9781473657601_300.jpeg","name":"Owning it: Your Bullsh*t-Free Guide To Living With Anxiety","author":"Caroline Foran","BookUrl":"https://www.dubraybooks.ie/Owning-it-Your-Bullsh_t-Free-Guide-To-Living-With-Anxiety_9781473657601","PublishDate":"11/05/2017"}
{"_id":"9780500292518","category":"History","decription":"From the origins of urbanization in Mesopotamia to the global metropolises of today, great cities have marked the development of human civilization. The Great Cities in History tells their stories, from Uruk and Memphis to Tokyo and Sao Paulo. A galaxy of distinguished contributors evoke the character of each place - its people, its art and architecture, its government - and explain the reasons for its success. Richly illustrated with photographs, paintings, maps and plans, this volume is nothing less than a portrait of world civilization.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/021/0212167_9780500292518_300.jpeg","name":"Great Cities in History","author":"John Julius Norwich","BookUrl":"https://www.dubraybooks.ie/Great-Cities-in-History_9780500292518","PublishDate":"28/07/2016"}
{"_id":"9781783963812","category":"History","decription":"One of the Daily Telegraph's Best Books of 2017; A Guardian `Readers' Choice' Best Book of 2017; Without the benefit of hindsight, how do you interpret what's right in front of your eyes?; The events that took place in Germany between 1919 and 1945 were dramatic and terrible but there were also moments of confusion, of doubt - of hope. How easy was it to know what was actually going on, to grasp the essence of National Socialism, to remain untouched by the propaganda or predict the Holocaust?; Travellers in the Third Reich is an extraordinary history of the rise of the Nazis based on fascinating first-hand accounts, drawing together a multitude of voices and stories, including students, politicians, musicians, diplomats, schoolchildren, communists, scholars, athletes, poets, journalists, fascists, artists, tourists, even celebrities like Charles Lindbergh and Samuel Beckett. Their experiences create a remarkable three-dimensional picture of Germany under Hitler - one so palpable that the reader will feel, hear, even breathe the atmosphere.; These are the accidental eyewitnesses to history. Disturbing, absurd, moving, and ranging from the deeply trivial to the deeply tragic, their tales give a fresh insight into the complexities of the Third Reich, its paradoxes and its ultimate destruction.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0251482_9781783963812_300.jpeg","name":"Travellers in the Third Reich: The Rise of Fascism Through the Eyes of Everyday People","author":"Julia Boyd","BookUrl":"https://www.dubraybooks.ie/Travellers-in-the-Third-Reich-The-Rise-of-Fascism-Through-the-Eyes-of-Everyday-People_9781783963812","PublishDate":"10/05/2018"}
{"_id":"9781473678842","category":"History","decription":"The compelling memoir from the UK's most eminent forensic scientist and some of the most fascinating criminal investigations she has worked on. 'The dead keep many secrets. Sometimes they are the only witness to a crime. But ask the right questions, and they will eventually reveal everything.' Never before has criminal justice rested so heavily on scientific evidence. With ever more sophisticated and powerful techniques at their disposal, forensic scientists have the ability to make or break a case. Angela Gallop has been a forensic scientist for over 40 years. After a brief spell studying sea slugs on the Isle of Wight, she joined the Forensic Science Service. Her first case was the Yorkshire Ripper. She is now the most sought after forensic scientist in the UK and has been involved in numerous high profile cases, including the Cardiff Three, the coastal path murders and the trail of Stephen Lawrence. From the crime scene to the courtroom, When the Dogs Don't Bark is the remarkable story of a life spent searching for the truth.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259958_9781473678842_300.jpeg","name":"When The Dogs Don't Bark","author":"Angela Gallop","BookUrl":"https://www.dubraybooks.ie/When-The-Dogs-Dont-Bark_9781473678842","PublishDate":"21/02/2019"}
{"_id":"9780717181612","category":"History","decription":"The incredible true story of the librarian, the Nazi spy and Ireland's secret role in turning the tide of World War II When unassuming librarian Richard Hayes, a gifted polymath and cryptographer, was drafted by Irish intelligence services to track the movements of a prolific Nazi spy, Hermann Goertz, Dublin became the unlikely venue for one of the most thrilling episodes in Irish history. In a complex game of cat-and-mouse that would wind its way through the city and its suburbs, Code Breaker reveals how Richard Hayes cracked a code that helped turn the tide of World War II, and uncovers a secret history of the capital that has remained hidden in plain view for the past 70 years.\n\nAuthor Biography: Marc McMenamin is a journalist and documentary maker. A specialist in exploring uncharted corners of Irish history, he is the maker of several acclaimed radio documentaries, including Good Cop/Bad Cop, exploring the life of controversial former NYPD officer Peter Daly, and Richard Hayes, Nazi Codebreaker.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259092_9780717181612_300.jpeg","name":"CODE BREAKER","author":"Marc McMenamin","BookUrl":"https://www.dubraybooks.ie/CODE-BREAKER_9780717181612","PublishDate":"05/10/2018"}
{"_id":"9780099791515","category":"History","decription":"It's spring 1983. It seemed that one of the most startling discoveries of the century had been made, and that one of the world's most sought after documents had finally come to light - the private diaries of Adolf Hitler. What followed was a fiasco of fakery, greed, the duping of experts, and the exchange of extraordinary sums of money for world-wide publishing rights. But that was just the beginning of the story.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0077917_9780099791515_300.jpeg","name":"Selling Hitler: The Story of the Hitler Diaries","author":"Robert Harris","BookUrl":"https://www.dubraybooks.ie/Selling-Hitler-The-Story-of-the-Hitler-Diaries_9780099791515","PublishDate":"01/08/1996"}
{"_id":"9780241186664","category":"History","decription":"'THE BEST TRUE SPY STORY I HAVE EVER READ' JOHN LE CARRE    A thrilling Cold War story about a KGB double agent, by one of Britain's greatest historiansOn a warm July evening in 1985, a middle-aged man stood on the pavement of a busy avenue in the heart of Moscow, holding a plastic carrier bag. In his grey suit and tie, he looked like any other Soviet citizen. The bag alone was mildly conspicuous, printed with the red logo of Safeway, the British supermarket.The man was a spy. A senior KGB officer, for more than a decade he had supplied his British spymasters with a stream of priceless secrets from deep within the Soviet intelligence machine. No spy had done more to damage the KGB. The Safeway bag was a signal: to activate his escape plan to be smuggled out of Soviet Russia. So began one of the boldest and most extraordinary episodes in the history of spying. Ben Macintyre reveals a tale of espionage, betrayal and raw courage that changed the course of the Cold War forever...","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0254390_9780241186664_300.jpeg","name":"The Spy and the Traitor: The Greatest Espionage Story of the Cold War","author":"Ben Macintyre","BookUrl":"https://www.dubraybooks.ie/The-Spy-and-the-Traitor-The-Greatest-Espionage-Story-of-the-Cold-War_9780241186664","PublishDate":"20/09/2018"}
{"_id":"9781789290530","category":"History","decription":"An accessible and succinct account of the story of Europe from its ancient foundations to the twenty-first century, The History of Europe in Bite-sized Chunks details the events, personalities, ideas and disasters that have shaped our continent.The book is broken down into six easily digestible chapters: Classical Antiquity (2600 BCE to 600 CE); Medieval (600-1500); Reform and Enlightenment (1500-1780); Age of Revolutions (1780-1914); the Wars (1914-45); and the Making of Contemporary Europe (1945 to present). It begins with the first ancient culture to emerge in Europe: the Minoans. It then proceeds chronologically to the present day, taking in not just significant historical events but also overarching social, technological and cultural trends and their impact.Throughout the book there are mini-biographies of notable individuals (such as Julius Caesar, Catherine the Great and Napoleon Bonaparte) who have been most significant in European history. It is also packed with amazing facts, details and maps that will give the reader a vivid understanding of Europe's pastWith the prospect of Brexit looming in Spring 2019, there is no better time to get a handle on European history!","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262470_9781789290530_300.jpeg","name":"The History of Europe in Bite-Sized Chunks","author":"Jacob F. Field","BookUrl":"https://www.dubraybooks.ie/The-History-of-Europe-in-Bite-Sized-Chunks_9781789290530","PublishDate":"07/03/2019"}
{"_id":"9781509803286","category":"History","decription":"From the bestselling author of Germania, Lotharinigia is the third installment in Simon Winder's personal history of Europe. In 843 AD, the three surviving grandsons of the great emperor Charlemagne met at Verdun. After years of bitter squabbles over who would inherit the family land, they finally decided to divide the territory and go their separate ways. In a moment of staggering significance, one grandson inherited the area we now know as France, another Germany and the third received the piece in between: Lotharingia.  Lotharingia is a history of in-between Europe. It is the story of a place between places. In this beguiling, hilarious and compelling book, Simon Winder retraces the various powers that have tried to overtake the land that stretches from the mouth of the Rhine to the Alps and the might of the peoples who have lived there for centuries.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0264102_9781509803286_300.jpeg","name":"Lotharingia","author":"Simon Winder","BookUrl":"https://www.dubraybooks.ie/Lotharingia_9781509803286","PublishDate":"07/03/2019"}
{"_id":"9781526607423","category":"History","decription":"'All roads used to lead to Rome. Today, they lead to Beijing.'When The Silk Roads was published in 2015, it became an instant classic. A major reassessment of world history, it compelled us to look at the past from a different perspective. The New Silk Roads brings this story up to date, addressing the present and future of a world that is changing dramatically.   Following the Silk Roads eastwards, from Europe through to China, by way of Russia and the Middle East, The New Silk Roads provides a timely reminder that we live in a world that is profoundly interconnected. In an age of Brexit and Trump, the themes of isolation and fragmentation permeating the Western world stand in sharp contrast to events along the Silk Roads since 2015, where ties have been strengthened and mutual cooperation established. With brilliant insight, Peter Frankopan takes a fresh look at the network of relationships being formed along the length and breadth of the Silk Roads today, assessing the global reverberations of these continual shifts in the centre of power - all too often absent from headlines in the West.   This important - and ultimately hopeful - book asks us to re-read who we are and where we are in the world, illuminating the themes on which all our lives and livelihood depend.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258765_9781526607423_300.jpeg","name":"The New Silk Roads: The Present and Future of the World","author":"Peter Frankopan","BookUrl":"https://www.dubraybooks.ie/The-New-Silk-Roads-The-Present-and-Future-of-the-World_9781526607423","PublishDate":"15/11/2018"}
{"_id":"9780753545348","category":"Music and Film","decription":"From despair, to where?On 1 February 1995, Richey Edwards, guitarist of the Manic Street Preachers, went missing at the age of 27. On the eve of a promotional trip to America, he vanished from his London hotel room, his car later discovered near the Severn Bridge, a notorious suicide spot. Over two decades later, Richey's disappearance remains one of the most moving, mysterious and unresolved episodes in recent pop culture history.  For those with a basic grasp of the facts, Richey's suicide seems obvious and undeniable. However, a closer investigation of his actions in the weeks and months before his disappearance just don't add up, and until now few have dared to ask the important questions. Withdrawn Traces is the first book written with the co-operation of the Edwards family, testimony from Richey's closest friends and unprecedented and exclusive access to Richey's personal archive. In a compelling real-time narrative, the authors examine fresh evidence, uncover overlooked details, profile Richey's state of mind, and brings us closer than ever before to the truth.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0255028_9780753545348_300.jpeg","name":"Withdrawn Traces","author":"Sara Hawys Roberts","BookUrl":"https://www.dubraybooks.ie/Withdrawn-Traces_9780753545348","PublishDate":"28/04/2017"}
{"_id":"9780747568766","category":"Music and Film","decription":"A prelude to fame, Just Kids recounts the friendship of two young artists--Patti Smith and Robert Mapplethorpe - whose passion fueled their lifelong pursuit of art. In 1967, a chance meeting between two young people led to a romance and a lifelong friendship that would carry each to international success never dreamed of. The backdrop is Brooklyn, Chelsea Hotel, Max's Kansas City, Scribner's Bookstore, Coney Island, Warhol's Factory and the whole city resplendent. Among their friends, literary lights, musicians and artists such as Harry Smith, Bobby Neuwirth, Allen Ginsberg, Sandy Daley, Sam Shepherd, William Burroughs, etc. It was a heightened time politically and culturally; the art and music worlds exploding and colliding. In the midst of all this two kids made a pact to always care for one another. Scrappy, romantic, committed to making art, they prodded and provided each other with faith and confidence during the hungry years--the days of cous-cous and lettuce soup. Just Kids begins as a love story and ends as an elegy. Beautifully written, this is a profound portrait of two young artists, often hungry, sated only by art and experience.And an unforgettable portrait of New York, her rich and poor, hustlers and hellions, those who made it and those whose memory lingers near.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0099227_9780747568766_300.jpeg","name":"Just Kids","author":"Patti Smith","BookUrl":"https://www.dubraybooks.ie/Just-Kids_9780747568766","PublishDate":"01/12/2010"}
{"_id":"9781472252302","category":"Music and Film","decription":"'Year of Wonder is an absolute treat - the most enlightening way to be guided through the year.' Eddie RedmayneClassical  music for everyone - an inspirational piece of music for every day of  the year, celebrating composers from the medieval era to the present  day, written by award-winning violinist and BBC Radio 3 presenter  Clemency Burton-Hill.Have you ever heard a piece of music so  beautiful it stops you in your tracks? Or wanted to discover more about  classical music but had no idea  where to begin? Year of Wonder  is a unique celebration of classical music by an author who wants to  share its diverse wonders with others and to encourage a love for this  genre in all readers, whether complete novices or lifetime enthusiasts. Clemency  chooses one piece of music for each day of the year, with a short  explanation about the composer to put it into context, and brings the  music alive in a modern and playful way, while also extolling the  positive mindfulness element of giving yourself some time every day to  listen to something uplifting or beautiful. Thoughtfully curated and  expertly researched, this is a book of classical music to  keep you company: whoever you are, wherever you're from.'The only requirements for enjoying classical music are open ears and an open mind.' Clemency Burton-HillPlaylists are available on most streaming music platforms including Apple Music and Spotify.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0254831_9781472252302_300.jpeg","name":"year of wonder","author":"Clemency Burton-Hill","BookUrl":"https://www.dubraybooks.ie/year-of-wonder_9781472252302","PublishDate":"04/10/2018"}
{"_id":"9780571349678","category":"Music and Film","decription":"In this, the first book to take a big-picture view of the entire post punk period, acclaimed author and music journalist Simon Reynolds recreates a time of tremendous urgency and idealism in pop music. Full of anecdote and insight, and featuring the likes of Joy Division, The Fall, Pere Ubu, PiL and Talking Heads, Rip It Up And Start Again stands as one of the most inspired and inspiring books on popular music ever written.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262300_9780571349678_300.jpeg","name":"Rip it Up and Start Again: Postpunk 1978-1984","author":"Simon Reynolds","BookUrl":"https://www.dubraybooks.ie/Rip-it-Up-and-Start-Again-Postpunk-1978-1984_9780571349678","PublishDate":"07/02/2019"}
{"_id":"9781911600909","category":"Music and Film","decription":"So, this is me. Lily Allen. I am a woman. I am a mother. I was a wife. I drink. I have taken drugs. I have loved and been let down. I am a success and a failure. I am a songwriter. I am a singer. I am all these things and more. When women share their stories, loudly and clearly and honestly, things begin to change - for the better. This is my story.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257535_9781911600909_300.jpeg","name":"My Thoughts Exactly","author":"Lily Allen","BookUrl":"https://www.dubraybooks.ie/My-Thoughts-Exactly_9781911600909","PublishDate":"20/09/2018"}
{"_id":"9781848893504","category":"Music and Film","decription":"Rory Gallagher is revered as one of the greatest guitarists ever to pick up the instrument. The energy of his shows and his commitment to the audience is legendary. His career began in an Irish showband, followed by four years as the central talent of Taste, regarded by many as the greatest Irish band of the 1960s. He went on to even greater fame as a solo artist in the 1970s. The Edge, Johnny Marr and Joe Bonamassa are among his many fans. Gallagher was an inveterate performer, often performing over one hundred gigs a year. Tragically, after his success peaked, his later life was troubled and ended in disillusion.Gallagher bounded across countless stages with the swagger of a rock star, but despite his extraordinary talent and global acclaim, offstage he was a shy and unassuming man, not given to ostentation. Unlike most of his rock peers, there were no wild parties, no marriages or divorces. Though appearing almost saintly to many, he had a steely ambition, and could hire and fire to realise his musical vision. His short life shifted between the bright lights of success and the darkness of personal struggle. Modest and private by nature, this fiery rocker with an inner angst has been shrouded in mystery since he first entered the public eye.Drawing on extensive interviews in Ireland and abroad with those who knew him, Julian Vignoles casts new light on the familial, musical and sociocultural contexts that inspired Gallagher, and on the complex personality that drove his career. Contrary to belief, he willingly rather than reluctantly spent three years in the Fontana showband. This was frowned on by the Christian Brothers who ran his secondary school, the North Monastery. Despite such negative encounters with the Church, many will be surprised to learn that the great showman was a devout Catholic all his life. Vignoles reassesses Gallagher's songwriting, suggesting it has been somewhat overlooked because of his dexterity as a guitarist. Crucially, the book shows how many of Gallagher's songs speak eloquently - and poignantly - about the person who penned them.Meticulously researched, this intimate portrait is the insightful biography that Rory Gallagher deserves. An engrossing read, it will be as revelatory for curious neophytes as for his legions of loyal fans.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0255587_9781848893504_300.jpeg","name":"Rory Gallagher: The Man Behind The Guitar","author":"Julian Vignoles","BookUrl":"https://www.dubraybooks.ie/Rory-Gallagher-The-Man-Behind-The-Guitar_9781848893504","PublishDate":"31/10/2018"}
{"_id":"9780241347935","category":"Music and Film","decription":"PRE-ORDER NOWLyrics and never-before-seen poetry and sketches from the iconic vocalist of Florence + the MachineSongs can be incredibly prophetic, like subconscious warnings or messages to myself, but I often don't know what I'm trying to say till years later. Or a prediction comes true and I couldn't do anything to stop it, so it seems like a kind of useless magic.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0252370_9780241347935_300.jpeg","name":"Useless Magic: Lyrics and Poetry","author":"Florence Welch","BookUrl":"https://www.dubraybooks.ie/Useless-Magic-Lyrics-and-Poetry_9780241347935","PublishDate":"05/07/2018"}
{"_id":"9780571349647","category":"Music and Film","decription":"In The Dark Stuff Nick Kent profiles twenty-two of the most gifted and self-destructive talents in rock history. From Brian Wilson to Syd Barrett, the Rolling Stones to Neil Young, Iggy Pop to Lou Reed, he offers intimate portraits that are unimaginable in the world of today's market driven music business.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262297_9780571349647_300.jpeg","name":"The Dark Stuff","author":"Nick Kent","BookUrl":"https://www.dubraybooks.ie/The-Dark-Stuff_9780571349647","PublishDate":"07/02/2019"}
{"_id":"9780571349654","category":"Music and Film","decription":"Rob Young investigates how the idea of folk has been handed down and transformed by successive generations - song collectors, composers, Marxist revivalists, folk-rockers, psychedelic voyagers, free festival-goers, experimental pop stars and electronic innovators. In a sweeping panorama of Albion's soundscape that takes in the pioneer spirit of Cecil Sharp; the pastoral classicism of Ralph Vaughan Williams and Peter Warlock; the industrial folk revival of Ewan MacColl and A. L. Lloyd; the folk-rock of Fairport Convention, Sandy Denny, Nick Drake, Shirley Collins, John Martyn and Pentangle; the bucolic psychedelia of The Incredible String Band, The Beatles and Pink Floyd; the acid folk of Comus, Forest, Mr Fox and Trees; The Wicker Man and occult folklore; the early Glastonbury and Stonehenge festivals; and the visionary pop of Kate Bush, Julian Cope and Talk Talk, Electric Eden maps out a native British musical voice that reflects the complex relationships between town and country, progress and nostalgia, radicalism and conservatism. An attempt to isolate the 'Britishness' of British music - a wild combination of pagan echoes, spiritual quest, imaginative time-travel, pastoral innocence and electrified creativity - Electric Eden will be treasured by anyone interested in the tangled story of Britain's folk music and Arcadian dreams.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0262298_9780571349654_300.jpeg","name":"Electric Eden: Unearthing Britain's Visionary Music","author":"Rob Young","BookUrl":"https://www.dubraybooks.ie/Electric-Eden-Unearthing-Britains-Visionary-Music_9780571349654","PublishDate":"07/02/2019"}
{"_id":"9780717181674","category":"Cookery","decription":"In The Baby-Friendly Family Cookbook, Aileen Cox Blundell,  mother of three and the creative force behind the popular Baby-Led Feeding blog, has created over 150 fuss-free recipes everyone in the family will love - from  the smallest to the biggest and including weaning babies.From lunch-box inspiration to nailing the art of advance meal preparation and efficient food shopping, Aileen gives step-by-step instructions on combatting fussy eating and introducing healthier options to mealtimes. Expand your range of dinnertime `go-tos' with dishes like Slow-Cooker Stew, Moroccan Turkey Meatballs and Baby-Friendly Chicken Tikka Masala.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0264417_baby-friendly-family-cookbook_300.jpeg","name":"Baby Friendly Family Cookbook","author":"Aileen Cox Blundell","BookUrl":"https://www.dubraybooks.ie/Baby-Friendly-Family-Cookbook_9780717181674","PublishDate":"01/03/2019"}
{"_id":"9781785031168","category":"Cookery","decription":"Everything you love about Ottolenghi, made simple.    Yotam Ottolenghi's award-winning recipes are always a celebration: an unforgettable combination of abundance, taste and surprise. Ottolenghi SIMPLE is no different, with 130 brand-new dishes that contain all the inventive elements and flavour combinations that Ottolenghi is loved for, but with minimal hassle for maximum joy.  Bursting with colourful photography, Ottolenghi SIMPLE showcases Yotam's standout dishes that will suit whatever type of cooking you find easy - whether that's getting wonderful food on the table in under 30 minutes, using just one pot to make a delicious meal, or a flavoursome dish that can be prepared ahead and then served when you're ready.  These brilliant, flavour-forward dishes are all SIMPLE in at least one (but very often more than one) way:   S    - short on time: less than 30 minutes  I     - 10 ingredients or lessM         - make aheadP            - pantry L -           lazyE            - easier than you think Ottolenghi SIMPLE is the stunning new cookbook we have all been wishing for: Yotam Ottolenghi's vibrant food made easy.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0254596_ottolenghi-simple_300.jpeg","name":"Ottolenghi SIMPLE","author":"Yotam Ottolenghi","BookUrl":"https://www.dubraybooks.ie/Ottolenghi-SIMPLE_9781785031168","PublishDate":"06/09/2018"}
{"_id":"9781785943898","category":"Cookery","decription":"The nation's queen of home cooking brings her foolproof, delicious approach to quick fix cooking.  In this brand-new, official tie-in to the major BBC One series, Mary shows how being in a rush will never be a problem again. Find brilliant 20- and 30-minute meals and enjoy wonderful dishes that can be swiftly assembled and then left to cook away while you do something else.  Mary's utterly reliable, always delicious fast dishes tempt any tastebuds and her no-fuss expertise means you can cook from scratch and put mouth-watering home-cooked food on your family's table without compromising on quality or freshness.  This stunning cookbook, packed with colourful photography, includes over 120 new recipes, including all the recipes from the series, plus Mary's trademark no-nonsense tips and techniques for getting ahead in the kitchen so cooking is always stress-free.  Looking for a fast, satisfying supper? There's Crumble fish pie, Lamb tagine with preserved lemon or Pan-fried spiced falafels. Something special for Sunday lunch or dinner with friends? Roast Venison fillet and peppercorn sauce, 30-minute Beef ragu or Roast fillet pork with sage and mustard sauce followed by Upside-down rhubarb pudding. With Mary's trusted advice and recipes, discover how easy fantastic fast cooking can be.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0260161_9781785943898_300.jpeg","name":"Mary Berry's Quick Cooking","author":"Mary Berry","BookUrl":"https://www.dubraybooks.ie/Mary-Berrys-Quick-Cooking_9781785943898","PublishDate":"31/01/2019"}
{"_id":"9781844884254","category":"Cookery","decription":"The No 1 bestsellers' new book - packed with quick and easy veggie options, clever meat-free versions of popular favourites and inspiring advice on how to be healthier!'These lovely boys always create incredibly tasty food' Jamie OliverThough they have written two No 1 bestselling vegetarian cookbooks, David and Stephen Flynn, the twins behind the Happy Pear cafes and food business, know it can be challenging to juggle everything and still feel inspired! And being busy dads themselves they also know the pressure of getting delicious healthy meals on the table every day.So Recipes for Happiness is very close to their hearts. And it does what it says on the cover: it is crammed with recipes to make you happier - including a huge section of economical easy dinners that can be rustled up in 15 minutes (chickpea tikka masala, thai golden curry, one-pot creamy mushroom pasta); gorgeous hearty dishes (goulash, Greek summer stew, an ingenious one-pot lasagne that's cooked the hob); a selection of plant-based alternatives to family favourites (burgers, hotdogs, cheatin' nuggets, kebabs), and irresistible treats (summer fruit bakewell tart, double choc brownie cake).For nearly 15 years David and Stephen's mantra has been Eat More Veg!. They have seen fads come and go and they know that what works - for themselves, their families and the thousands of people who eat the Happy Pear way. Cook from Recipes for Happiness and you too will definitely be well on the way to making your life healthier and happier!'The poster boys for a healthy way of life!' Sunday Times'A healthy eating phenomenon' Mail on Sunday'These twins are on a roll' Time Out'[They] couldn't look healthier or happier ... poster boys for vegetarianism' The Times","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0267455_9781844884254_300.jpeg","name":"The Happy Pear: Recipes for Happiness","author":"David Flynn","BookUrl":"https://www.dubraybooks.ie/The-Happy-Pear-Recipes-for-Happiness_9781844884254","PublishDate":"03/05/2018"}
{"_id":"9780717172924","category":"Cookery","decription":"This pocket-sized bread and baking book includes all the classic Irish recipes, from soda bread to fadge, with chapters on bread and scones, cakes, tarts, crumbles, pies, biscuits and bakes and more beside! Every recipe is illustrated with a full-colour photograph, with easy-to-follow text.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/022/0222720_9780717172924_300.jpeg","name":"Irish Granny's Pocket Book of Bread and Baking","author":"Tony Potter","BookUrl":"https://www.dubraybooks.ie/Irish-Grannys-Pocket-Book-of-Bread-and-Baking_9780717172924","PublishDate":"03/02/2017"}
{"_id":"9781473674264","category":"Cookery","decription":"Home-cooked food is an aspiration for most people but with our increasingly busy lives it just doesn't seem achievable for most of us. For TV chef Donal, moving house and leaving his own kitchen, with an ever-changing schedule and a newborn baby, cooking suppers based on whatever he could pick up from the local shop was an eye-opening experience that brought him face to face with the challenges many people have, and made him re-evaluate the way he cooked.Donal's Meals in Minutes is the result: a collection of 90 simple, delicious and healthy recipes that are stripped back to the basics but still taste delicious.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0253398_donals-meals-in-minutes_300.jpeg","name":"Donal's Meals in Minutes","author":"Donal Skehan","BookUrl":"https://www.dubraybooks.ie/Donals-Meals-in-Minutes_9781473674264","PublishDate":"06/09/2018"}
{"_id":"9780717180790","category":"Cookery","decription":"Get ready to go back to school with Neven Maguire and discover Home Economics for Life! Can't cook? Won't cook? This fantastic new cooking bible presents Neven's selection of the only 50 recipes you need to know - and how to make them right. You'll discover how to make a good tomato sauce, how to dress a salad, roasting techniques and how to make stock from the bones, the art of brown bread, the trick for perfect scrambled eggs, formulas for sauces and soups and easy-to-make cakes and treats. Every recipe is broken down into easy-to-follow step-by-step bites, ready for you to master. So pledge to learn one recipe a week and by this time next year, you'll be certified in Home Economics for Life!\n\nAuthor Biography: Neven Maguire is Ireland's favourite chef and has sold over 100,000 cookbooks in Ireland. This is his 17th cookbook. A regular on RTE television, he lives in Blacklion, Co. Cavan with his wife Amelda and young twins Connor and Lucia, where he runs the perennially popular MacNean House & Restaurant, and the Neven Maguire Cookery School.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258172_neven-maguires-home-economics-for-life_300.jpeg","name":"Neven Maguire's Home Economics For Life","author":"Neven Maguire","BookUrl":"https://www.dubraybooks.ie/Neven-Maguires-Home-Economics-For-Life_9780717180790","PublishDate":"14/09/2018"}
{"_id":"9781788080583","category":"Cookery","decription":"In her first and highly anticipated recipe book, Siobhan lays out all her advice and recipes that she has curated through years of experience in teaching weaning classes. Her philosophy is simple: Cook for family, adapt for baby. The book includes invaluable step-by-step advice to raising a happy healthy eater, and more than 100 delicious recipes that are baby and family friendly.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0249325_9781788080583_300.jpeg","name":"Mummy Cooks Baby & Family Recipe Book; Cook for family, adapt for baby","author":"Siobhan Berry","BookUrl":"https://www.dubraybooks.ie/Mummy-Cooks-Baby-Family-Recipe-Book%3b-Cook-for-family-adapt-for-baby_9781788080583","PublishDate":"19/02/2018"}
{"_id":"9780717159000","category":"Cookery","decription":"Enjoy the best of Irish granny's classic recipes. This pocket-sized cookery book includes all the classic Irish dishes, from Boxty to Barm Brack. There are breakfasts, soups, starters, breads, cakes and biscuits, main dishes, preserves and drinks and a special section on Christmas favourites. Every recipe is illustrated with a full-colour photograph, with easy-to-follow text.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/009/0098032_9780717159000_300.jpeg","name":"The Irish Granny's Pocket Recipe Book: Over 110 Classic Dishes","author":"Tony Potter","BookUrl":"https://www.dubraybooks.ie/The-Irish-Grannys-Pocket-Recipe-Book-Over-110-Classic-Dishes_9780717159000","PublishDate":"07/03/2014"}
{"_id":"9781787014664","category":"Travel Literature","decription":"Lonely Planet: The world's #1 phrasebook publisher* Lonely Planet Japanese Phrasebook & Dictionary is your handy passport to culturally enriching travels with the most relevant and useful Japanese phrases and vocabulary for all your travel needs. Get to know your sushi from your sake, enjoy an elaborate tea ceremony with its centuries'-old conventions, and find your way elaborate transit maps; all with your trusted travel companion. With language tools in your back pocket, you can truly get to the heart of wherever you go, so begin your journey now! Get More From Your Trip with Easy-to-Find Phrases for Every Travel Situation! Feel at ease with essential tips on culture, manners, idioms and multiple meanings Order with confidence, explain food allergies, and try new foods with the menu decoder Save time and hassles with vital phrases at your fingertips Never get stuck for words with the 3500-word two-way, quick-reference dictionary Be prepared for both common and emergency travel situations with practical phrases and terminology Meet friends with conversation starter phrases Get your message across with easy-to-use pronunciation guides Inside Lonely Planet Japanese Phrasebook & Dictionary: Full-colour throughout User-friendly layout organised by travel scenario categories Survival phrases inside front cover for at-a-glance on-the-fly cues Convenient features 5 Phrases to Learn Before You Go 10 Ways to Start a Sentence 10 Phrases to Sound like a Local Listen For - phrases you may hear Look For - phrases you may see on signs Shortcuts - easy-to-remember alternatives to the full phrases Q &A - suggested answers to questions asked  Covers Basics - time, dates, numbers, amounts, pronunciation, reading tips, grammar rules Practical - travel with kids, disabled travellers, sightseeing, business, banking, post office, internet, phones, repairs, bargaining, accommodations, directions, border crossing, transport Social - meeting people, interests, feelings, opinions, going out, romance, culture, activities, weather Safe Travel - emergencies, police, doctor, chemist, dentist, symptoms, conditions Food - ordering, at the market, at the bar, dishes, ingredients The Perfect Choice: Lonely Planet Japanese Phrasebook & Dictionary, a pocket-sized comprehensive language guide, provides on-the-go language assistance; great for language students and travellers looking to interact with locals and immerse themselves in local culture. About Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves. The world awaits! *#1 phrasebook publisher. Source: Nielsen Bookscan UK, US & AUS","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259021_9781787014664_300.jpeg","name":"Lonely Planet Japanese Phrasebook & Dictionary","author":"Lonely Planet","BookUrl":"https://www.dubraybooks.ie/Lonely-Planet-Japanese-Phrasebook-Dictionary_9781787014664","PublishDate":"01/09/2018"}
{"_id":"9780141186108","category":"Travel Literature","decription":"In 1960, John Steinbeck set out to rediscover and document his native land; accompanied only by his dog, he travelled all across the United States in a pick-up truck. This \"Penguin Classics\" edition of \"Travels with Charley\" includes an introduction by Jay Parini. When he was almost sixty years old, worried that he might have lost touch with the sights, the sounds and the essence of America's people, Steinbeck took note of his itchy feet and prepared to travel. He was accompanied by his French poodle, Charley, diplomat and watchdog, across the states of America from Maine to California. Moving through the woods and deserts, dirt tracks and highways to large cities and glorious wildernesses, Steinbeck observed - with remarkable honesty and insight, with a humorous and sometimes sceptical eye - America, and the Americans who inhabited it. What he saw was a lonely, generous nation too packed with individuals for single judgements; what he saw made him proud, angry, sympathetic and elated. His vision of how the world was changing still speaks to us prophetically through the decades.John Steinbeck (1902-68), winner of the Pulitzer Prize and the Nobel Prize for literature, is remembered as one of the greatest and best-loved American writers of the twentieth century. During the Second World War Steinbeck served as a war correspondent, his journalism later collected in \"Once There Was a War\" (1958), and he was awarded the Norwegian Cross of Freedom for his portrayal in \"The Moon is Down\" (1942) of Resistance efforts in northern Europe. His best-known works include the epics \"The Grapes of Wrath\" (1939) and \"East of Eden\" (1952), and his tragic novella \"Of Mice and Men\" (1937). John Steinbeck's complete works are published in \"Penguin Modern Classics\". If you enjoyed \"Travels with Charley\", you might like \"Cannery Row\", also available in \"Penguin Modern Classics\". \"Pure delight, a pungent potpourri of places and people\". (\"The New York Times Book Review\").","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/008/0087211_9780141186108_300.jpeg","name":"Travels with Charley: In Search of America","author":"John Steinbeck","BookUrl":"https://www.dubraybooks.ie/Travels-with-Charley-In-Search-of-America_9780141186108","PublishDate":"01/03/2001"}
{"_id":"9781786485830","category":"Travel Literature","decription":"The Countries of the World in Minutes is the quickest way to understand the modern world and every country in it.For each of the 195 officially recognised countries of the world, a mini-essay clearly and concisely explains its key history, characteristics and social and political structures. Alongside, an outline map shows each country's global location, main geographic features and capital city, whilst a table of essential data details its population, political system, languages, major religions, currency, gross domestic product, main industries, and much more.Illustrated with 195 up-to-date country maps.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256586_9781786485830_300.jpeg","name":"Countries of the World in Minutes","author":"Jacob F. Field","BookUrl":"https://www.dubraybooks.ie/COUNTRIES-OF-THE-WORLD-IN-MINUTES_9781786485830","PublishDate":"01/11/2018"}
{"_id":"9781786855312","category":"Travel Literature","decription":"Travel is the only thing you can buy that makes you richerTravel opens our minds to the world; it helps us to embrace risk and uncertainty, overcome challenges and understand the people we meet and the places we visit. But what happens when we arrive home? How do our experiences shape us?The Kindness of Strangers explores what it means to be vulnerable and to be helped by someone we've never met before. Someone who could have walked past, but chose not to.This is a collection of stories by accomplished travellers and adventurous souls like Sarah Outen, Benedict Allen, Ed Stafford and Al Humphreys, who have completed daring journeys through challenging terrain, adventuring from the Calais Jungle to the Amazon, from Land's End to the Gobi Desert, from New Guinea to Iran and many other places in between. Each has a story to tell of a time when they were vulnerable, when they were in need and a kind stranger came to their rescue.These are stories that make our hearts grow, stories that will restore our faith in the world and remind us that, despite what the media says, the world isn't a scary place - rather, it is filled with Kind Strangers just like us.All royalties go directly to fund Oxfam's work with refugees.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256010_9781786855312_300.jpeg","name":"THE KINDNESS OF STRANGERS","author":"Fearghal O'Nuallain","BookUrl":"https://www.dubraybooks.ie/THE-KINDNESS-OF-STRANGERS_9781786855312","PublishDate":"13/09/2018"}
{"_id":"9781787290235","category":"Travel Literature","decription":"Tim Moore - indefatigable travelling everyman - switches two wheels for four as he journeys across Trumpland in an original Model T Ford. Lacking any mechanical knowledge or intuition, he sets off to bully a car from East to West armed only with a top speed of 25 mph, a fan belt made of cotton, wooden wheels (again) and a truckload of 'wise-ass Limey liberal gumption'. His route takes him exclusively through Trump-voting counties as he travels the nation meeting the everyday folk who voted red, or rather orange. Along the way he drives through the disintegrating rust belt, Detroit - the spiritual home of the Model T, through the mid-west, cowboy country and finally threading he way through a lonely stretch of Oregon, 'where everyone is either a lumberjack or a prison officer'. And he needs to do it in three months before the wall goes up and he's booted back to Blighty. With his trademark blend of humour, perceptive insight and peril, Tim Moore gives us a unique vantage point into Trump's America.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258151_9781787290235_300.jpeg","name":"Another Fine Mess","author":"Tim Moore","BookUrl":"https://www.dubraybooks.ie/Another-Fine-Mess_9781787290235","PublishDate":"08/11/2018"}
{"_id":"9781786578655","category":"Travel Literature","decription":"Featuring communist bunkers, burning gas craters and at least one sponge-rock fluorescent grotto built by Polish monks, this book reveals weird and wonderful sights the crowds don't reach. We've all heard of India's Taj Mahal, but what about Karna Mata Temple? It's a building teeming with rats so revered they enjoy A-list treatment with daily offerings of milk and fruit.  It's no secret that visitors to Berlin can see parts of its infamous Wall still standing in the city. Not so many people know that segments of the wall have travelled all around the world and can be found in places including Los Angeles, Japan and Iceland.  Stonehenge is one of the UK's most popular tourist sites. So why not beat the crowds and head to Nebraska instead, where you can marvel at a Carhenge - a replica of the great monolith site constructed entirely from vintage cars. This packed and fascinating title takes its readers on a journey through the world's lesser known marvels. Dive into an underworld of the planet's most surprising, fun, perplexing, kitsch and downright bizarre sights - and explore human stories and mysterious happenings that you won't find inside a regular guidebook. From eerie natural wonders to historical oddities and bizarre architecture, this is a travel companion for the incurably curious. About Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves. The world awaits! Lonely Planet guides have won the TripAdvisor Traveler's Choice Award in 2012, 2013, 2014, 2015, and 2016. 'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' -- Fairfax Media 'Lonely Planet guides are, quite simply, like no other.' - New York Times","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/023/0236029_9781786578655_300.jpeg","name":"Secret Marvels of the World","author":"Lonely Planet","BookUrl":"https://www.dubraybooks.ie/Secret-Marvels-of-the-World_9781786578655","PublishDate":"01/08/2017"}
{"_id":"9780956003805","category":"Travel Literature","decription":"Chris, eternal optimist and itinerant sheep shearer, moves with his wife Ana to a mountain farm in Las Alpujarras, an oddball region in the south of Spain. Misadventures gleefully unfold as Chris discovers that the owner has no intention of leaving and meets their neighbours, an engaging mix of peasant farmers and shepherds, New Age travellers and ex-pats. Their daughter Chloe is born, linking them irrevocably to their new life. The hero of the piece, however, is the farm itself - a patch of mountain studded with olive, almond and lemon groves, sited on the wrong side of a river, with no access road, water supply or electricity.  Could life offer much better than that?","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/010/0108726_9780956003805_300.jpeg","name":"Driving Over Lemons: An Optimist in Andalucia","author":"Chris Stewart","BookUrl":"https://www.dubraybooks.ie/Driving-Over-Lemons-An-Optimist-in-Andalucia_9780956003805","PublishDate":"04/06/2009"}
{"_id":"9781426219733","category":"Travel Literature","decription":"Completely updated for its 10th anniversary, this best-selling inspirational travel guide reveals 500 celebrated and lesser-known destinations from around the globe, from ocean cruises in Antarctica to horse treks in the Andes. Compiled from the favorite trips of National Geographic's legendary travel writers, this fully updated and revised Journeys of a Lifetime spans the globe to highlight the best of the world's most celebrated and lesser-known sojourns. Offering a diverse array of possibilities, every continent and possible form of transport is covered, illustrated with glorious color photographs. With 16 new pages and updated information throughout, this timely new edition is the perfect resource for travelers who crave adventurous trips--from trekking the heights of Mt. Kilimanjaro in Tanzania to mountain biking in Transylvania--and those searching for more specific experiences (the world's top small cruises, hot new museums around the world, secrets for following in the footsteps of film and TV heroes, and more). Each chapter features stunning photography, full-color maps, and practical tips, including how to get there, when to visit, and how to make the most of your journey. Informative, and inspiring, this luxurious volume is a lifelong resource that readers will treasure for years to come.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259474_9781426219733_300.jpeg","name":"Journeys of a Lifetime, Second Edition","author":"National Geographic","BookUrl":"https://www.dubraybooks.ie/Journeys-of-a-Lifetime-Second-Edition_9781426219733","PublishDate":"29/10/2018"}
{"_id":"9780241360286","category":"Travel Literature","decription":"Join Sunday Times bestselling author of Spectacles, Sue Perkins as she travels around Southeast Asia and beyond. Share in her hilarious and heartfelt adventure as she journeys from India to Indonesia- driving the historic Ho Chi Minh Trail, exploring the tranquil Mekong River, and being felt-up by a charismatic Cambodian hermit!Inspired by her popular BBC travel shows and documentaries- The Mekong River with Sue Perkins,Kolkata with Sue Perkins, The Ganges with Sue Perkins and World's Most Dangerous Roads- Ho Chi Minh Trail this book is ideal for existing Sue fans as well as travel enthusiasts who are looking for an Asian adventure full of wit and warmth.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259005_9780241360286_300.jpeg","name":"East","author":"Sue Perkins","BookUrl":"https://www.dubraybooks.ie/EAST_9780241360286","PublishDate":"15/10/2018"}
{"_id":"9780241969359","category":"Travel Literature","decription":"This is Sunday Times Top Ten Bestseller. Acclaimed and beloved travel writer Paul Theroux turns his attention to his own country - America - for the first time in Deep South. For the past fifty years, Paul Theroux has travelled to the far corners of the earth - to China, India, Africa, the Pacific Islands, South America, Russia, and elsewhere - and brought them to life in his cool, exacting prose. In Deep South he turns his gaze to a region much closer to his home.  Travelling through North and South Carolina, Georgia, Tennessee, Mississippi, Alabama and Arkansas, Paul Theroux writes of the stunning landscapes he discovers - the deserts, the mountains, the Mississippi - and above all, the lives of the people he meets. The South is a place of contradictions. There is the warm, open spirit of the soul food cafes, found in every town, no matter how small. There is the ruined grandeur of numberless ghostly towns, long abandoned by the industries that built them. There are the state gun shows and the close-knit, subtly forlorn tribe of people who attend and run them.Deep in the heart of his native country, Theroux discovers a land more profoundly foreign than anything he has previously experienced.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/020/0204121_9780241969359_300.jpeg","name":"Deep South","author":"Paul Theroux","BookUrl":"https://www.dubraybooks.ie/Deep-South_9780241969359","PublishDate":"03/03/2016"}
{"_id":"9780500545089","category":"Art","decription":"`A singular new vision and an original contribution to the development of street photography' Martin Parr  Focused on D1, Dublin's city centre, Eamonn Doyle's three major bodies of work, `i', `On' and `End' - with new and previously unpublished images brought together here for the first time - tell the tale of today's Dublin and, in doing so, tell a broader story of today's Ireland. Setting aside the nostalgia and cliche so often seen in `stories of Ireland', Doyle's vernacular photography is a thrill to the system, revealing the extraordinary within the ordinary to paint a striking portrait of a modern and multicultural capital city. Vivified in colour, the commonplace is seen anew, the everyday made epic as the city's inhabitants appear in stark, graphic black and white going about their daily business. Far from pedestrian, Doyle's work is the archetype of good street photography: real life brought to life through the lens and voice of the street. Punctuating the photography with specially commissioned narratives is the distinctive voice of Kevin Barry, evoking the world beyond the frame: the sights, smells, sounds and sensations of a Dubliner's daily life. Designed by Doyle's longtime collaborator Niall Sweeney, fusing contemporary Irish word and contemporary Irish image, Made in Dublin is one of the most exciting and original books of street photography in recent years.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/026/0265873_9780500545089_300.jpeg","name":"Eamonn Doyle: Made In Dublin","author":"Eamonn Doyle","BookUrl":"https://www.dubraybooks.ie/Eamonn-Doyle-Made-In-Dublin_9780500545089","PublishDate":"07/03/2019"}
{"_id":"9781473630833","category":"Art","decription":"'A mind-expanding tour of the world without leaving your paintbox. Every colour has a story, and here are some of the most alluring, alarming, and thought-provoking. Very hard painting the hallway magnolia after this inspiring primer.'  Simon GarfieldThe Secret Lives of Colour tells the unusual stories of the 75 most fascinating shades, dyes and hues. From blonde to ginger, the brown that changed the way battles were fought to the white that protected against the plague, Picasso's blue period to the charcoal on the cave walls at Lascaux, acid yellow to kelly green, and from scarlet women to imperial purple, these surprising stories run like a bright thread throughout history. In this book Kassia St Clair has turned her lifelong obsession with colours and where they come from (whether Van Gogh's chrome yellow sunflowers or punk's fluorescent pink) into a unique study of human civilisation. Across fashion and politics, art and war, The Secret Lives of Colour tell the vivid story of our culture.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0253385_9781473630833_300.jpeg","name":"Secret Lives of Colour","author":"Kassia St Clair","BookUrl":"https://www.dubraybooks.ie/Secret-Lives-of-Colour_9781473630833","PublishDate":"06/09/2018"}
{"_id":"9781849942850","category":"Art","decription":"Millie Marotta is a hugely popular illustrator and her idiosyncratic drawings of the botanical world are stunning. Millie Marotta's Tropical World invites you to lose yourself in a riot of colouring in and drawing. Her beautiful illustrations are crying out for a touch of colour, an additional line here and there  -  the most mindful of activities.  The artist's intricate style of illustration will get you itching to make your own mark, whether it's to add to the fine lines on exotic trees, or add a splash of colour to petals on an exotic bloom or the feathers of a tropical parrot. Pens, crayons or paints can bring them all to life. Add your own colours to the rainsforest scenes, make a pattern with your colour choices, or try out your drawing skills by adapting the illustration. Each picture offers scope to improve your artistic skills while relaxing. The images and imaginative scenarios can be completed in colours of your choosing and are guaranteed to get your creative juices flowing. This book will bring enjoyment not only to illustrators and designers, but anyone who is looking for a creative outlet or mindful activity.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/017/0176708_9781849942850_300.jpeg","name":"Millie Marotta's Tropical Wonderland: A Colouring Book Adventure","author":"MAROTTA MILLIE","BookUrl":"https://www.dubraybooks.ie/Millie-Marottas-Tropical-Wonderland-A-Colouring-Book-Adventure_9781849942850","PublishDate":"22/06/2015"}
{"_id":"9781847179579","category":"Art","decription":"After completing her own home renovation and extension, Fiona McPhillips, author, journalist and interiors fanatic, was inspired to bring together everything she learned along the way. In collaboration with three award-winning architects, Fiona provides you with the most holistic approach to your design and build.A practical step-by-step guide to surviving the transformation of your home, taking the reader from the design stage, through the planning process to building, decorating and finishing touches. The balance of personal stories and professional advice makes this an accessible and inspiring guide to renovation. Filled with photographs of real homes, this books is bursting with great ideas and will no doubt inspire you to make the home you love.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0246379_9781847179579_300.jpeg","name":"Make The Home You Love","author":"Fiona McPhillips","BookUrl":"https://www.dubraybooks.ie/Make-The-Home-You-Love_9781847179579","PublishDate":"26/03/2018"}
{"_id":"9781471166785","category":"Art","decription":"The #1 New York Times Bestseller `Walter Isaacson is not an art historian, he's simply a lover of Leonardo, who manages to communicate the sheer joy of this remarkable man'Books of the Year - The Times `Walter Isaacson keeps the mortal man to the fore. For all his supernatural gifts as an artist and natural scientist.  Leonardo was resolutely human (illegitimate, vegan, in need of patrons) rather than the near deity of legend.  Isaacson is an assured guide to Leonardo's fallibility - so many projects started, so few completed - as well as his extraordinary curiosity and his even more remarkable painterly skills that were sharpened by intense observation.'  Michael Prodger, Books of the Year - The Sunday Times'Infinitely curious, easily distracted, vain and vegetarian, Leonardo is brought to vivid life in this accomplished biography.' - The SundayTimes. 'an illuminating guide to the output of one of the last millennium's greatest minds.' - The Observer 'Isaacson doesn't claim to make any fresh discoveries, but his book is intelligently organised, simply written and beautifully illustrated.' Book of the Day, The Guardian. 'Isaacson's scholarship is impressive-he cites not only primary sources but secondary materials by art critics, essayists, and da Vinci's other biographers. This is a monumental tribute to a titanic figure.' - Publisher's Weekly\"A powerful story of an exhilarating mind and life...a study in creativity: how to define it, how to achieve it.\"-The New Yorker\"Vigorous, insightful.\"-The Washington Post\"A masterpiece.\"-San Francisco Chronicle\"Luminous.\"-The Daily Beast 'To read this magnificent biography of Leonardo da Vinci is to take a tour through the life and works of one of the most extraordinary human beings of all time in the company of the most engaging, informed, and insightful guide imaginable. Walter Isaacson is at once a true scholar and a spellbinding writer. And what a wealth of lessons there are to be learned in these pages.' David McCullough The creator of Salvator Mundi (Saviour of the World) officially sold at auction in New York in November 2017 for the record-breaking sum of GBP341 million. He was history's most creative genius. What secrets can he teach us? Based on thousands of pages from Leonardo's astonishing notebooks and new discoveries about his life and work, Walter Isaacson weaves a narrative that connects his art to his science. He shows how Leonardo's genius was based on skills we can improve in ourselves, such as passionate curiosity, careful observation, and an imagination so playful that it flirted with fantasy. He produced the two most famous paintings in history, The Last Supper and the Mona Lisa. But in his own mind, he was just as much a man of science and technology. With a passion that sometimes became obsessive, he pursued innovative studies of anatomy, fossils, birds, the heart, flying machines, botany, geology, and weaponry. His ability to stand at the crossroads of the humanities and the sciences, made iconic by his drawing of Vitruvian Man, made him history's most creative genius. His creativity, like that of other great innovators, came from having wide-ranging passions. He peeled flesh off the faces of cadavers, drew the muscles that move the lips, and then painted history's most memorable smile. He explored the math of optics, showed how light rays strike the cornea, and produced illusions of changing perspectives in The Last Supper. Isaacson also describes how Leonardo's lifelong enthusiasm for staging theatrical productions informed his paintings and inventions. Leonardo's delight at combining diverse passions remains the ultimate recipe for creativity. So, too, does his ease at being a bit of a misfit: illegitimate, gay, vegetarian, left-handed, easily distracted, and at times heretical. His life should remind us of the importance of instilling, both in ourselves and our children, not just received knowledge but a willingness to question it-to be imaginative and, like talented misfits and rebels in any era, to think different.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0257266_9781471166785_300.jpeg","name":"Leonardo Da Vinci","author":"Walter Isaacson","BookUrl":"https://www.dubraybooks.ie/Leonardo-Da-Vinci_9781471166785","PublishDate":"17/10/2018"}
{"_id":"9781786695314","category":"Art","decription":"Making his name as a Pop artist in the late 1960s and 70s, Robert Ballagh quickly achieved an international reputation. With little formal artistic training, he triumphed in his field despite often formidable hostility. His work was also strikingly topical and political, playing with classic images by Goya or Delacroix to express outrage about the situation in Northern Ireland. But it is his series of realistic portraits of writers, politicians and fellow artists - often searingly inquisitive and moving in equal measure - that have won him lasting fame. His subjects include Brian Friel, Seamus Heaney, Samuel Beckett, Francis Crick, Harold Pinter and Fidel Castro. And his remarkable self-portraits unsparingly document the process of his own ageing. This is also a story of Ireland over the past sixty years, its violence, hypocrisy and immobility as well as its creativity and generosity.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0255646_9781786695314_300.jpeg","name":"A Reluctant Memoir","author":"Robert Ballagh","BookUrl":"https://www.dubraybooks.ie/A-Reluctant-Memoir_9781786695314","PublishDate":"20/09/2018"}
{"_id":"9781780671062","category":"Art","decription":"Tumble down the rabbit hole and find yourself in an inky black-and-white wonderland. This interactive activity book takes you on a ramble through a secret garden created in beautifully detailed pen-and-ink illustrations  -  all waiting to be brought to life through colouring, but each also sheltering all kinds of tiny creatures just waiting to be found. And there are also bits of the garden that still need to be completed by you.  Appealing to all ages, the intricately-realized world of the Secret Garden is both beautiful and inspirational.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/013/0136785_9781780671062_300.jpeg","name":"Secret Garden: An Inky Treasure Hunt and Colouring Book","author":"Johanna Basford","BookUrl":"https://www.dubraybooks.ie/Secret-Garden-An-Inky-Treasure-Hunt-and-Colouring-Book_9781780671062","PublishDate":"01/02/2013"}
{"_id":"9780241255988","category":"Art","decription":"Learn how to draw with charcoal, pen, and pastel with step-by-step workshops from professional artists. Artist's Drawing Techniques is your guide to every aspect of drawing for pleasure, from choosing a subject to mounting your finished masterpiece. Turn your hand to over 80 artist's techniques including cross-hatching, stippling, blending, and masking using pencil, charcoal, coloured pencils, and pastels. Develop your artistic style by following step-by-step drawing tutorials through beginner, intermediate, and advanced projects.  Take on creative challenges with inspiring exercises and art projects to develop your skills, and stunning feature drawings to showcase every artistic technique and guide you on your way. Unlock your creative potential with Artist's Drawing Techniques.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/023/0231598_9780241255988_300.jpeg","name":"Artist's Drawing Techniques","author":"DK","BookUrl":"https://www.dubraybooks.ie/Artists-Drawing-Techniques_9780241255988","PublishDate":"31/07/2017"}
{"_id":"9780241366356","category":"Art","decription":"\"Radical and inspiring ... Yanagi's vision puts the connection between heart and hand before the transient and commercial\" - Edmund de WaalThe daily lives of ordinary people are replete with objects, common things used in commonplace settings. These objects are our constant companions in life. As such, writes Soetsu Yanagi, they should be made with care and built to last, treated with respect and even affection. They should be natural and simple, sturdy and safe - the aesthetic result of wholeheartedly fulfilling utilitarian needs. They should, in short, be things of beauty.In an age of feeble and ugly machine-made things, these essays call for us to deepen and transform our relationship with the objects that surround us. Inspired by the work of the simple, humble craftsmen Yanagi encountered during his lifelong travels through Japan and Korea, they are an earnest defence of modest, honest, handcrafted things - from traditional teacups to jars to cloth and paper. Objects like these exemplify the enduring appeal of simplicity and function: the beauty of everyday things.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259850_9780241366356_300.jpeg","name":"Beauty of Everyday Things","author":"Soetsu Yanagi","BookUrl":"https://www.dubraybooks.ie/Beauty-of-Everyday-Things_9780241366356","PublishDate":"08/01/2019"}
{"_id":"9780714878294","category":"Art","decription":"Annie Leibovitz, our most celebrated living photographer, explains how her pictures are madeLeibovitz addresses young photographers and readers interested in what photographers do, but any reader interested in contemporary history will be fascinated by her account of one of the richest bodies of work in the photographic canon. The subjects include photojournalism, studio work, photographing dancers and athletes, working with writers, and making the transition from shooting with film to working with digital cameras. Originally published in 2008, this revised and updated edition brings Leibovitz's bestselling book back into print.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256229_9780714878294_300.jpeg","name":"Annie Leibovitz at Work","author":"Annie Leibovitz","BookUrl":"https://www.dubraybooks.ie/Annie-Leibovitz-at-Work_9780714878294","PublishDate":"22/10/2018"}
{"_id":"9781781175736","category":"Sport Books","decription":"`Magee is Ireland's answer to Johnny Tapia - Gibson captures the craziness of his life brilliantly. A book that is impossible to put down' Carl Frampton\n\n'Raw, riveting, beautifully written...an unforgettable book.' Donald McRae, The Guardian \n\nEamonn Magee is widely regarded as one of the most gifted fighters to ever emerge from Ireland. Yet, despite becoming a world champion in 2003, such was his genius it will always be considered a career unfulfilled. Women, drink, drugs, gambling, depression and brushes with the law all took Eamonn away from his craft. Then there was the violence: a throat slashed, an IRA bullet in the calf, a savage, leg-shattering beating. Wherever Eamonn went, trouble was never too far behind. Upon his retirement, Eamonn turned his attention to training and oversaw the rise of his son's boxing career. However, the prospect of a Magee dynasty was cruelly halted in 2015 when Eamonn Jnr was brutally stabbed to death in West Belfast in a premeditated attack. The Lost Soul of Eamonn Magee is a uniquely intimate telling of a barely believable life story. It is a compelling story filled with heartache and laughter, violence and love, unthinkable lows and fleeting, glorious highs. Eamonn's is a story for which the term `brutally honest' might have been coined.\n\nAuthor Biography: Paul Gibson is a journalist whose work appears regularly in 'The Guardian', 'The Belfast Telegraph' and 'Boxing Monthly', amongst many others. His first book, an autobiography of the UFC fighter Dan Hardy, was released in March 2017. Eamonn Magee grew up in the Ardoyne area of Belfast and is a former professional boxer. He held the Commonwealth light-welterweight title twice, and challenged for the European light-welterweight and British welterweight titles. He is a veteran of the Irish and European professional fight scenes and fought out of the Breen Gym in Belfast, where he now works as an assistant trainer to John Breen.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0244734_9781781175736_300.jpeg","name":"The Lost Soul of Eamonn Magee","author":"Paul Gibson","BookUrl":"https://www.dubraybooks.ie/The-Lost-Soul-of-Eamonn-Magee_9781781175736","PublishDate":"20/04/2018"}
{"_id":"9781471175374","category":"Sport Books","decription":"Based on three years of extensive research and reporting, two of today's most acclaimed investigative journalists, Jeff Benedict of Sports Illustrated and eleven-time Emmy Award winner Armen Keteyian, deliver the first major biography of Tiger Woods - sweeping in scope and packed with groundbreaking, behind-the-scenes details of the Shakespearean rise and epic fall of a global icon. In 2009, Tiger Woods was the most famous athlete on the planet, a transcendent star of almost unfathomable fame and fortune living what appeared to be the perfect life - married to a Swedish beauty and the father of two young children. Winner of fourteen major golf championships and seventy-nine PGA Tour events, Woods was the first billion-dollar athlete, earning more than $100 million a year in endorsements from the likes of Nike, Gillette, AT&T and Gatorade. But it was all a carefully crafted illusion. As it turned out, Woods had been living a double life for years - one that exploded in the aftermath of a late-night crash that exposed his serial infidelity and sent his personal and professional life off a cliff. In Tiger Woods, Jeff Benedict and Armen Keteyian dig deep behind the headlines to produce a richly reported answer to the question that has mystified millions of sports fans for nearly a decade: who is Tiger Woods? Drawing on more than four hundred interviews with people from every corner of Woods's life - friends, family members, teachers, romantic partners, swing coaches, business associates, Tour pros and members of Woods's inner circle - Benedict and Keteyian construct a captivating psychological profile of an African-American child programmed by an attention-grabbing father and the original Tiger Mom to be the 'chosen one', to change not just the game of golf, but the world as well. But at what cost?Benedict and Keteyian provide the startling answers in a biography destined to make headlines and linger in the minds of readers for years to come.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/024/0249571_9781471175374_300.jpeg","name":"Tiger Woods","author":"Jeff Benedict","BookUrl":"https://www.dubraybooks.ie/Tiger-Woods_9781471175374","PublishDate":"27/03/2018"}
{"_id":"9780007281435","category":"Sport Books","decription":"He is one of the most beloved athletes in history and one of the most gifted men ever to step onto a tennis court - but from early childhood Andre Agassi hated the game. Coaxed to swing a racket while still in the crib, forced to hit hundreds of balls a day while still in grade school, Agassi resented the constant pressure even as he drove himself to become a prodigy, an inner conflict that would define him. Now, in his beautiful, haunting autobiography, Agassi tells the story of a life framed by such conflicts. Agassi makes us feel his panic as an undersized seven-year-old in Las Vegas, practicing all day under the obsessive gaze of his violent father. We see him at thirteen, banished to a Florida tennis camp. Lonely, scared, a ninth-grade dropout, he rebels in ways that will soon make him a 1980s icon. By the time he turns pro at sixteen, his new look promises to change tennis forever, as does his lightning fast return. And yet, despite his raw talent, he struggles early on. We feel his confusion as he loses to the world's best, his greater confusion as he starts to win.After stumbling in three Grand Slam finals, Agassi shocks the world, and himself, by capturing the 1992 Wimbledon. Overnight he becomes a fan favorite and a media target. Agassi brings a near-photographic memory to every pivotal match, and every public relationship. Alongside vivid portraits of rivals, Agassi gives unstinting accounts of his brief time with Barbra Streisand and his doomed marriage to Brooke Shields. He reveals the depression that shatters his confidence, and the mistake that nearly costs him everything. Finally, he recounts his spectacular resurrection and his march to become the oldest man ever ranked number one. In clear, taut prose, Agassi evokes his loyal brother, his wise coach, his gentle trainer, all the people who help him regain his balance and find love at last with Stefanie Graf. With its breakneck tempo and raw candor, Open will be read and cherished for years. A treat for ardent fans, it will also captivate readers who know nothing about tennis. Like Agassi's game, it sets a new standard for grace, style, speed and power.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/007/0073666_9780007281435_300.jpeg","name":"Open: An Autobiography","author":"Andre Agassi","BookUrl":"https://www.dubraybooks.ie/Open-An-Autobiography_9780007281435","PublishDate":"10/08/2010"}
{"_id":"9781509856701","category":"Sport Books","decription":"The All Blacks are the greatest sports team on the planet. With a better winning record than any other sports team in history, they stand head and shoulders above their nearest rugby rivals, and go to the 2019 World Cup as back-to-back World Champions. How did an island of just 4.8 million people conquer the world?Peter Bills, who has reported on international rugby for more than 40 years, was given exclusive access to all the key figures in New Zealand rugby as he set out to understand the secrets behind the All Blacks success. From Steve Hansen to Beauden Barrett, Richie McCaw to the late Sir Colin Meads, Peter Bills talked at length with over 90 people, both in New Zealand and around the world, with intimate knowledge of what makes the All Blacks tick.This is a story of the first settlers, and the 'Originals' who forged the All Blacks legacy, right through to modern times. It draws heavily on the contributions made by all New Zealanders: players, coaches, officials, supporters and those who have worn the most recognized jersey in the world. Intrinsically, The Jersey goes to the heart of the All Blacks success. It is also an epic story of not just a rugby team but a nation, whose identities are inextricably linked. Additionally, it debates a question, terrifying for any of their opponents. Could the All Blacks get even better?","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0254182_9781509856701_300.jpeg","name":"the jersey","author":"Peter Bills","BookUrl":"https://www.dubraybooks.ie/the-jersey_9781509856701","PublishDate":"09/08/2018"}
{"_id":"9780717179602","category":"Sport Books","decription":"At All Costs gets inside the mind of one of GAA's most talked-about personalities.Possessed of an unshakeable work ethic and determination to succeed, all-Ireland winning hurler and manager Davy Fitzgerald has established a reputation as one of the finest hurling talents of his generation.For Davy, however, a man every bit the perfectionist, victory has always come at a cost. His list of playing and managerial honours is matched by a roll call of controversies and arguments. In this raw and surprisingly vulnerable account of his life in hurling, Fitzgerald confronts his legacy, his fiery reputation and the most enduring controversies of his career, all the while considering the cost pursuit of victory has taken on himself and those closest to him. Candid and self-aware, it is sure to be one the most talked-about books this year.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259036_9780717179602_300.jpeg","name":"At All Costs","author":"Davy Fitzgerald","BookUrl":"https://www.dubraybooks.ie/At-All-Costs_9780717179602","PublishDate":"19/10/2018"}
{"_id":"9780717183449","category":"Sport Books","decription":"In 2005, at the age of 20, Andy Lee decided he was going to try to make it in the harsh and unforgiving world of professional boxing. Leaving home for the dust and faded glamour of Detroit, over the next ten years, under the guidance of the legendary Manny Steward, he set about honing his craft, winning fight after fight, and slowly ascending the professional ranks.Then, in 2012, his star ascendant, Lee suffered two devastating blows in quick succession: defeat in his first world championship bout and the sudden loss of Steward, his guide and confidant. Bereft, his career in jeopardy, the path to redemption would test every hard-won lesson of the previous decade.Fighter is a lyrical and philosophical memoir about resilience, bravery and the wisdom to be found at the limits of human experience. Praise for Andy Lee`One of the most universally beloved fighters in the game, known for his heart inside the ring and his class outside it.' Donald McRae, The Guardian `Lee was a good fighter but he's an even better human being.' Pundit Arena `Andy Lee is one of life's good people. Not too many people get to be an Olympian, a world champion & liked by pretty much everyone they meet. He's a superstar.' Jacqui Hurley `A true role model for kids sportsmanship and manners and such an articulate speaker.' Niall Kennedy","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0258180_9780717183449_300.jpeg","name":"Fighter","author":"Andy Lee","BookUrl":"https://www.dubraybooks.ie/Fighter_9780717183449","PublishDate":"26/10/2018"}
{"_id":"9781473666740","category":"Sport Books","decription":"Today was his first climb to the top. He knew if he was there, watching, then she would never leave him. Her name was Bernadette and he climbed the shed every day.~This is a not a football book, as such. Rather, it is a memoir by someone who happened to have superior ability at the sport during his formative years which led him on a remarkable journey.  Paul Ferris became a professional footballer and at the age of 16 was the youngest ever to play in Newcastle United's first team. Coming from Northern Ireland and being a skilful winger with dancing feet, he was inevitably hailed as 'the new George Best'. But  the story of his time in the game, particularly as a young player, is one of insecurity, injuries, uncertainty, fear and, ultimately, a failure to fulfil his hopes and dreams.The book opens in Lisburn, near Belfast. The Ferris family are Catholics in a predominantly Protestant town at the height of the 'Troubles'. Ferris re-lives his childhood and teens with brutal candour laced with black humour.The Boy on the Shed is a beautifully written account of a life, but it also lifts the lid on big personalities at Newcastle United.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259321_9781473666740_300.jpeg","name":"BOY ON THE SHED","author":"Paul Ferris","BookUrl":"https://www.dubraybooks.ie/BOY-ON-THE-SHED_9781473666740","PublishDate":"24/01/2019"}
{"_id":"9781473667020","category":"Sport Books","decription":"'Visualise your goals and achieve your potential.'Easy-to-follow and extremely effective, Win will change the way you think about all aspects of your life.From well-known personality and rugby commentator Brent Pope and psychotherapist and mental skills coach Jason Brennan, Win: Proven Strategies for Success in Sports, Life and Mental Health examines the mindset behind the psychology of winning and how the mental skills applied in sports can be adapted for success in everyday life. From dealing with failure, to managing stress and anxiety, to changing your definition of winning - and with interviews from some of the world's most high-profile sports stars including Ronan O'Gara, Bernard Brogan, Conrad Smith, Dean Rock, AP McCoy, Sonia O'Sullivan, Gary O'Donovan and Paul O'Donovan, Dan Carter and many others - Win looks at how you can gain confidence, achieve your goals and build lifelong inner mental strength and resilience - today.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0259322_9781473667020_300.jpeg","name":"Win","author":"Brent Pope","BookUrl":"https://www.dubraybooks.ie/Win_9781473667020","PublishDate":"03/01/2019"}
{"_id":"9781844884315","category":"Sport Books","decription":"Dublin has become the dominant force in Gaelic football, setting new standards of skill and efficiency. But it was not very long ago that the county was a byword for underachievement and disorganization. Every year from 1996 to 2010, the Dubs found new and creative ways of losing, of causing their fans to suffer, and of earning the scorn of the wider GAA public.Based on interviews with former players and coaches, Dublin: The Chaos Years tells the entertaining and sometimes scarcely believable story of how the Dubs managed to make such a hames of things over a period of fifteen years. It also traces the beginnings of the turnaround, as the bad habit of failure began to give way to a healthier culture. Full of frank, witty and sometimes outrageous stories and analysis from the people who were at the centre of it, Dublin: The Chaos Years is a book for every Gaelic football fan.","imagelink":"https://www.dubraybooks.ie/content/images/thumbs/025/0256429_9781844884315_300.jpeg","name":"Dublin: The Chaos Years","author":"Neil Cotter","BookUrl":"https://www.dubraybooks.ie/Dublin-The-Chaos-Years_9781844884315","PublishDate":"04/10/2018"}
